{
    "points": [ 
        { "no": 1, "city": "Rajgir", "year": "6th century BCE to 460 BCE", "information": "Rajgir, known in ancient times as Girivraj, was the initial capital of the Magadha Empire from the 6th century BCE to 460 BCE. The city's strategic location, surrounded by hills, made it a naturally fortified and significant political and cultural hub , Rajgir served as the first capital of the Magadha Empire, playing a crucial role in the region's political and cultural development., Period: c. 544 BCE – 413 BCE The Haryanka dynasty marked the rise of Magadha as a significant power in ancient India. Bimbisara expanded the kingdom through conquests and alliances, while his son Ajatashatru further fortified Rajgir and expanded the empire. This period also saw the growth of Buddhism and Jainism in the region, Period: c. 413 BCE – 345 BCE Shishunaga initially made Vaishali his capital before moving it back to Rajgir and then to Pataliputra. His reign was characterized by consolidation and stability, maintaining Rajgir's importance ,Period: c. 345 BCE – 322 BCE The Nanda dynasty, known for its administrative efficiency and wealth, eventually shifted the capital to Pataliputra. However, Rajgir's historical and cultural significance remained intact. ", "empire": " Mauryan Empire, Magadha empire", "dynasty": "Haryanka dynasty, Pradyota dynasty ,Shishunaga Dynasty ,Nanda Dynasty, Brihadratha dynasty, " ,"current_name": "Ragir", "reference": ["https://en.wikipedia.org/wiki/List_of_capitals_of_India", "https://en.wikipedia.org/wiki/Rajgir", "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 2, "city": "Pataliputra", "year": "490 BCE", "information": "Pataliputra, formed around 490 BCE, became the capital of the Magadha Empire, succeeding Rajgir. Its strategic location and political importance made it a prominent center throughout several key dynasties. Haryanka Dynasty (c. 544 BCE – 413 BCE) Under the Haryanka dynasty, Ajatashatru moved the capital from Rajgir to Pataliputra, marking its rise as a significant political hub. This move enhanced the strategic and administrative capabilities of the Magadha Empire. Shishunaga Dynasty (c. 413 BCE – 345 BCE) The Shishunaga dynasty further consolidated Pataliputra's status as the capital. Shishunaga ensured the city remained the epicenter of political activity, solidifying its importance in the empire. Nanda Dynasty (c. 345 BCE – 322 BCE) During the Nanda dynasty, Pataliputra flourished as a wealthy and fortified city. Mahapadma Nanda’s centralization and administrative efficiency turned Pataliputra into a critical hub of wealth and power. Maurya Dynasty (c. 322 BCE – 185 BCE) The Maurya dynasty, particularly under Chandragupta Maurya and Ashoka, saw Pataliputra become the heart of a vast empire. It witnessed significant advancements in administration and culture, including the spread of Buddhism under Ashoka’s reign. Pataliputra’s role as the capital of the Magadha Empire under these dynasties underscores its historical significance as a major political, administrative, and cultural center in ancient India.", "empire": "Shishunaga Empire (c.413-345 BCE), Nanda Empire (c.460 or 420 - c.325 BCE), the Maurya Empire (c.320-180 BCE), the Gupta Empire (c.320-550 CE), and the Pala Empire (c.750-1200 CE)", "dynasty": "Nanda dynasty,Maurya dynasty, Gupta dynasty" ,"current_name": "Patna", "reference": [ "https://en.wikipedia.org/wiki/List_of_capitals_of_India", "https://en.wikipedia.org/wiki/Pataliputra", "https://en.wikipedia.org/wiki/List_of_capitals_of_India", " https://en.wikipedia.org/wiki/Pataliputra", "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 3, "city": "Begram and Mathura", "year": "1st century CE to 3rd century CE", "information": "The Kushan Empire established Begram and Mathura as its capitals during the 1st century CE. The Kushan Empire, under rulers like Kanishka the Great, utilized Begram as the summer capital and Mathura as the winter capital, reflecting the empire's vast territorial reach and strategic administrative planning. These capitals played crucial roles in trade, culture, and governance, contributing to the empire's prosperity and influence in Central and South Asia.", "empire": "Kushan Empire", "dynasty": "" ,"current_name": "Mathura", "reference": [ "https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Bagram","https://en.wikipedia.org/wiki/Mathura ","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 4, "city": "Pratishthana Amaravati", "year": "1st century BCE to 3rd century CE", "information": "The Satavahana Empire, which dominated a significant portion of ancient India from the 1st century BCE to the 3rd century CE, had two prominent capitals: Pratishthana and Amaravati. Pratishthana, located in present-day Paithan in Maharashtra, was established as the primary capital around the 1st century BCE. It served as the political and administrative center of the Satavahana Empire, crucial for managing its extensive territory. Amaravati, in present-day Andhra Pradesh, emerged as an important cultural and economic hub around the 2nd century CE. While not the primary capital, Amaravati became a significant center known for its Buddhist stupa and artistic achievements. The choice of these capitals reflects the Satavahana Empire's strategic approach to governance, with Pratishthana serving as the main administrative center and Amaravati enhancing the empire's cultural and economic influence.", "empire": "Satavahana Empire", "dynasty": " ancient Indian dynasty" ,"current_name": "Paithan , Amaravati, Maharashtra", "reference":[ "https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Paithan" ,"https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"] },
        { "no": 5, "city": "Srikakulam, Krishna district", "year": "1st century BCE to the 3rd century CE", "information": "Srikakulam in the Krishna district of present-day Andhra Pradesh as one of its significant capitals. Established around the 1st century BCE, Srikakulam became a key center for administration and governance, particularly for the empire's eastern territories. The strategic selection of Srikakulam as a capital underscores the Satavahana rulers' aim to effectively manage and control their extensive domain. This city not only facilitated administrative efficiency but also played a crucial role in the cultural and economic activities of the region. The establishment of Srikakulam as a capital highlights the Satavahana Empire's intricate planning and its efforts to integrate various parts of its territory into a cohesive and well-governed entity.", "empire": "Satavahana Empire", "dynasty": "Satavahana dynasty, Eastern Ganga Dynasty" ,"current_name": "Srikakulam", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Srikakulam,_Krishna_district" , "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 6, "city": "Kandapura", "year": "4th or 5th century AD", "information": "During the 4th century CE, Kandapura emerged as a significant center of power, becoming the capital of the Ananda Gotrika dynasty. This development marked a pivotal period for the dynasty, as it sought to consolidate its governance and exert control over its territories. By establishing Kandapura as their political and administrative hub, the Ananda Gotrika dynasty demonstrated a strategic approach to centralizing their rule and organizing their domains The establishment of Kandapura as the capital city underscored the dynasty's commitment to effective administration and regional influence. Through this centralized seat of power, the Ananda Gotrika dynasty aimed to streamline their governance, enhance their authority, and ensure efficient management of their territories. This marked a significant milestone in their history, reflecting their efforts to establish a strong and organized empire. While historical records may not provide us with exhaustive details about the broader empire, the rise of Kandapura in the 4th century CE serves as a testament to the dynasty's astute political maneuvering and their deliberate pursuit of administrative cohesion. By designating Kandapura as their capital, the Ananda Gotrika dynasty signaled their ambition to govern with authority and to exert control over the regions under their rule. In light of these historical circumstances, it is evident that the Ananda Gotrika dynasty's establishment of Kandapura as their capital city represented a pivotal moment in their quest for centralized governance and regional dominance. Their strategic approach to administration during this era highlights their dedication to consolidating power and organizing their territories effectively.", "empire": "", "dynasty": "Ananda Gotrika dynasty" ,"current_name": "Kanchipuram", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Chejerla,_Palnadu_district","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 7, "city": "Rajahmundry", "year": "7th century to the 12th century CE ", "information": "Imagine Rajahmundry, a bustling city that was once the capital of both the Eastern Chalukya Kingdom and the Reddi Kingdom. This place was a real power player in the political and administrative history of those empires. Let's dive into this fascinating tale! Back in the 8th century CE, the Eastern Chalukya Kingdom saw something special in Rajahmundry. They thought, So, they established it as a prominent center for governance and cultural development. You can just imagine the hustle and bustle of the city, with people working hard to consolidate the kingdom's power in the region. It must have been an exciting time! Fast forward a few centuries to the 14th century CE, and Rajahmundry finds itself in the spotlight once again. This time, it becomes the capital of the Reddi Kingdom. The Reddi rulers saw the importance of this city and decided to make it their administrative hub. Can you picture the grand buildings and busy streets, filled with officials and bureaucrats running around, making sure everything was in order? It was like the heartbeat of the kingdom! Throughout these periods, Rajahmundry was not just a city; it was a symbol of power and influence. Its status as a capital city highlighted its strategic significance and its vital role in the governance and cultural landscape of these dynasties. It was a place where decisions were made, where policies were shaped, and where the history of these empires was written. So, let's take a moment to appreciate the rich history of Rajahmundry and the important role it played in the rise and fall of these mighty kingdoms. It's a reminder that even cities have stories to tell, and Rajahmundry has certainly left its mark on the pages of history.", "empire": "The Eastern Chalukya", "dynasty": "Reddi dynasty" ,"current_name": "Rajahmundry", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Rajahmundry","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 8, "city": "Vangipuram or Peddavegi", "year": " 3rd century CE", "information": "Imagine standing in the vibrant city of Vangipuram, a place that holds a rich history of political power and administrative prowess. Back in the 3rd century CE, the Salankayana dynasty recognized the potential of this city and chose it as their capital. They saw Vangipuram as the perfect spot to establish their authority, manage their territories, and strengthen their rule. It became the beating heart of their political activities and the center of their governance. Centuries later, around the 7th century CE, the Eastern Chalukya Kingdom rose to prominence and took over Vangipuram as one of their capitals. The Eastern Chalukyas were known for their administrative skills and love for culture, and they saw Vangipuram as a city with immense potential. They built upon the existing infrastructure, further developing Vangipuram as a bustling administrative hub. The city flourished under their rule, witnessing remarkable growth in both cultural and economic aspects. It's fascinating to see how Vangipuram remained an important capital for different dynasties over the centuries. The fact that both the Salankayana dynasty and the Eastern Chalukya Kingdom recognized its strategic significance speaks volumes about the city's enduring importance. It demonstrates how historical capitals like Vangipuram could adapt to the changing needs of different ruling powers, leaving behind a legacy of power and influence that still resonates today.", "empire": "", "dynasty": "Salankayana dynasty" ,"current_name": "Vangipuram and Peddavegi", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Vangipuram","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 9, "city": "Vijayapuri South, Nagarjunakonda", "year": "3rd and 4th centuries CE", "information": "Imagine stepping into the ancient city of Vijayapuri South, also known as Nagarjunakonda, where history comes alive. This city served as the capital of the Andhra Ikshvakus dynasty, a powerful ruling force in ancient India. It's incredible to think that this place was once the epicenter of political power, administration, and culture. Around the early 3rd century CE, the Andhra Ikshvakus decided to establish their capital in Vijayapuri South. This decision marked a turning point for the city and the dynasty. As you wander through the ruins and remnants of the past, you can almost feel the vibrancy and growth that once thrived here. Nagarjunakonda was not just a political hub but also a center of knowledge and spirituality. Buddhist teachings and culture flourished within its boundaries, evident from the majestic stupas, monasteries, and inscriptions that still stand today. The city's strategic location along the Krishna River made it an ideal spot for trade and communication, further boosting its significance. The Andhra Ikshvakus embraced Vijayapuri South not only as a seat of power but also as a place to nurture and promote their cultural heritage. They were dedicated to supporting Buddhism and other cultural activities, leaving a lasting impact on the city's legacy. As you explore the remnants of this ancient capital, you can't help but marvel at the Andhra Ikshvakus' strategic and cultural influence. Vijayapuri South stands as a testament to their vision and the vibrant history of the region.", "empire": "Ikshvaku Empire", "dynasty": "Ikshvaku dynasty" ,"current_name": "Nagarjuna Sagar", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Nagarjunakonda","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 10, "city": "Kalinganagara", "year": "5th century CE", "information": "Kalinganagara, or Mukhalingam as it is known today, played a fascinating role as the capital of the Eastern Ganga dynasty in eastern India. The Eastern Gangas rose to prominence around the 5th century CE and made Kalinganagara their power hub for all things political, administrative, and cultural. Imagine a bustling city filled with vibrant markets, where traders from different regions converged to exchange goods and ideas. Kalinganagara thrived as a center of economic activity, benefiting from its strategic location along important trade routes. The city's streets were alive with the sounds of merchants haggling and the aroma of exotic spices filling the air. But Kalinganagara was not just about commerce; it was a place where art and religion flourished. The Eastern Gangas were great patrons of Hinduism, particularly the worship of Vishnu and Shiva. Temples dedicated to these deities adorned the city, their intricate sculptures and carvings mesmerizing all who visited. The echoes of devotional chants and the fragrance of incense wafted through the temple corridors, creating a spiritual aura that enveloped the capital. The Eastern Ganga dynasty's passion for art and architecture left an indelible mark on Kalinganagara. The remnants of their magnificent temples and sculptures still captivate visitors today, transporting them back to a time when creativity and devotion thrived. In essence, Kalinganagara was more than just a capital city; it was a vibrant tapestry woven with the threads of trade, culture, and spirituality. Its rise as the center of the Eastern Ganga dynasty showcased their vision for a prosperous and culturally rich empire. The legacy of Kalinganagara lives on, reminding us of the enduring impact that great civilizations can have on the world.", "empire": "", "dynasty": "easten ganga dynasty" ,"current_name": "Mukhalingam", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Mukhalingam","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 11, "city": "Kannauj", "year": "April 606 -c.647 CE", "information": "Kannauj, located in present-day Uttar Pradesh, holds a significant place in Indian history as the capital of both the empire of Harshavardhana and the Pratihara dynasty. During the early 7th century, Harshavardhana established Kannauj as his capital, leading to a period of cultural and political consolidation in northern India. Scholars, poets, and religious leaders flocked to Kannauj, making it a center of learning, religion, and administration. Following Harshavardhana's reign, Kannauj experienced a period of decline until the rise of the Pratihara dynasty in the 8th century. The Pratiharas chose Kannauj as their capital, revitalizing its status as a significant political and cultural hub. Known for their military prowess and administrative skills, the Pratiharas used Kannauj to control the Gangetic plains and extend their influence over northern India. This era witnessed a resurgence in architectural and cultural activities, with the construction of temples and other monuments. Kannauj's strategic location along the Ganges River played a crucial role in its prominence. It facilitated trade and commerce, connecting the northern plains to other parts of the Indian subcontinent. As a capital city, Kannauj served as an administrative center and a catalyst for cultural and intellectual growth. Its influence extended beyond its immediate surroundings, shaping the broader historical and cultural landscape of ancient India.", "empire": "Harshavardhana's empire", "dynasty": "Pushyabhuti dynasty, Pratihara dynasty" ,"current_name": "Kannauj", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Kannauj","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 12, "city": "Manyakheta, Avanti", "year": "8th and 9th centuries CE", "information": "Manyakheta and Avanti held great significance as capitals during the rule of the Rashtrakuta dynasty and the Pratihara Empire, respectively. The Rashtrakutas, who emerged as a prominent power in the 8th century CE, designated Manyakheta, situated in present-day Karnataka, as the hub of their political and administrative activities. This decision marked a period of remarkable growth and consolidation for the Rashtrakutas, renowned for their military prowess, extensive trade networks, and patronage of the arts and culture. Manyakheta thrived as the capital, enabling the dynasty to exert its influence over vast territories across the Indian subcontinent. Similarly, Avanti, also known as Ujjain, served as the capital of the Pratihara Empire during its zenith in the 8th and 9th centuries CE. Located in present-day Madhya Pradesh, Avanti played a vital role in the administration, cultural development, and commerce of the empire. The strategic positioning of Avanti facilitated control over crucial trade routes, empowering the Pratiharas to maintain their dominance over northern and central India. The choices of Manyakheta and Avanti as capitals exemplify the strategic and cultural significance these cities held in ancient Indian empires. They symbolize the Rashtrakutas' and Pratiharas' pursuit of consolidating their power, fostering cultural progress, and effectively managing their vast domains.", "empire": "Pratihara Empire", "dynasty": " Pradyota dynasty, Rashtrakuta dynasty" ,"current_name": "Mankhed , Ujjain", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Malkheda" ,"https://en.wikipedia.org/wiki/Avanti_(region)","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 13, "city": "Gadhipur", "year": " 4th to the 6th century CE", "information": "An important historical site in modern-day India, Gadhipur served as the capital of the Jamwal rulers Gaadhi and Vishvamitra as well as the Gupta dynasty's administrative hub. The Gupta dynasty is well-known for its outstanding contributions to Indian culture, science, and administration. It ruled from about the fourth to the sixth century CE. Gadhipur played a significant role as the empire's administrative hub, even though Pataliputra (present-day Patna) was the principal city of the Gupta Empire. The city played a vital role in the Gupta administration, helping to oversee the empire's vast lands and foster its intellectual and cultural developments. The historical importance of Gadhipur stems from its function as the capital of the Jamwal monarchs Gaadhi and Vishvamitra. An ancient dynasty called the Jamwals established A significant center of politics and culture is Gadhipur. The city's renown during this time precedes the Gupta dynasty, and it is a testament to its significance for both cultural advancement and regional governance. The legendary and historical accounts of ancient India are credited to the Jamwal monarchs, among them Gaadhi and Vishvamitra. Gadhipur has been an important administrative hub and strategic position throughout its history. During the Gupta era, the city's role in government persisted in bolstering the stability and expansion of the empire. Gadhipur's continued relevance as a key place in ancient Indian history, connecting multiple historical epochs and representing the evolution of regional power and culture, is highlighted by the change from the Jamwal period to the Gupta rule.", "empire": "", "dynasty": "Gupta dynasty, Jamwal dynasty" ,"current_name": "Gadhipur", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Ghazipur","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 14, "city": "Karur", "year": "3rd century BCE to the 12th century CE", "information": "One of the major Dravidian kingdoms in South India, the Chera dynasty, had its capital city, Karur, in modern-day Tamil Nadu. Early in its history, the Chera dynasty—which ruled from roughly the third century BCE to the twelfth century CE—established Karur as its capital. The city was an important hub for administration and trade because of its advantageous placement along the trade routes that connected South India's interior to the western coast. Karur was an important focus of cultural and commercial activity as well as politics during the Chera kingdom. The city was essential to the Cheras' attempts to control their vast lands and center their power. Karur's significance is emphasized by its function in promoting trade, both domestically in South India and internationally, particularly trade with Southeast Asia and the Roman Empire. Karur's cultural vibrancy was enhanced by the patronage of many arts, literature, and religious organizations by the Chera kings, who included prominent rulers like Cheran Senguttuvan. Ancient Tamil literature also highlights the importance of the city, frequently referring to Karur as a vibrant hub of political and cultural activity. The Chera dynasty's administration shifted its focus throughout time, as evidenced by the capital moving to other cities like Vanci or Kodungallur, but Karur's early position as the capital highlights the city's fundamental significance in the history of the empire. Its heritage continues to provide witness to the Cheras' historical and cultural impact across South India.", "empire": "", "dynasty": "Chera dynasty" ,"current_name": "Karur", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Karur","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 15, "city": "Dharapuram", "year": "3rd century CE to the 13th century CE", "information": "The capital of Kongu Nadu, a significant area in ancient South India, was Dharapuram, which is now in Tamil Nadu. Approximately from the third to the thirteenth century CE, the Kongu Nadu region—which was important historically—established Dharapuram as its capital. Over time, the Early Cholas, Cheras, and Kongu Cholas were among the dynasties that dominated the Kongu Nadu region. The capital's function emphasizes the city's pivotal role in administering and dominating the Kongu Nadu region, which was renowned for its thriving agricultural sector and advantageous placement along important trade routes. Dharapuram developed into a significant administrative and commercial hub while serving as the capital, aiding in the consolidation of authority and growth in Kongu Nadu. The importance of the city is demonstrated by its support for regional governance, resource management, and trade facilitation. The capital of Dharapuram was chosen to highlight the city's strategic significance as well as its contribution to the historical and cultural advancement of Kongu Nadu. The region's historical significance in ancient South Indian history is highlighted by its status as a capital city.", "empire": " Kongu Nadu", "dynasty": "Cheras, Western Ganga Dynasty" ,"current_name": "Dharapuram", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Dharapuram","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 16, "city": "Puhar", "year": "3rd century BCE", "information": "The Early Cholas were a prominent South Indian dynasty, with their capital city being Puhar, which is now in Tamil Nadu. Puhar became the capital of the Early Chola dynasty, which began to dominate in the third century BCE. Puhar, which is well-known for its advantageous Coromandel Coast position, developed into a crucial center for Early Chola administration, trade, and culture. The Early Cholas' control over trade routes and maritime activity was made easier by Puhar's status as the region's capital, which increased their wealth and clout. The city's growth as a hub for trade and cultural events, connected to other regions of India and Southeast Asia by its port, is indicative of its prominence. When the Early Chola era began and continued till Puhar played a crucial role in strengthening Chola authority and fostering regional prosperity during the Middle Chola emergence in the ninth century CE. The city's strategic significance, administrative function during the Early Cholas, and regional influence are all highlighted by its status as a capital.", "empire": "Chola Kings and Emperors", "dynasty": " Early Chola dynasty" ,"current_name": "Poompuhar", "reference":[ "https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Puhar,_Mayiladuthurai","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 17, "city": "Madurai", "year": "6th century BCE", "information": "Madurai, an ancient city in Tamil Nadu, was a central capital for the Pandya dynasty, which played a significant role in South India's history. The Pandya dynasty, one of the oldest Tamil dynasties, established Madurai as its capital around the 6th century BCE. This period marked the beginning of Madurai's prominence as a major political, cultural, and economic center in the region. Under the Pandyas, Madurai became a vibrant hub of administration and trade. The city's location, strategically positioned near key trade routes, facilitated its growth as a commercial powerhouse. It became a focal point for maritime trade, linking South India with other regions, including the Arabian Peninsula and Southeast Asia. This trade network brought considerable wealth to the city and bolstered its economic importance. Culturally, Madurai was renowned for its contributions to Tamil literature, arts, and religion. The Meenakshi Amman Temple, a magnificent architectural marvel dedicated to the goddess Meenakshi, became a symbol of the city's religious and cultural significance. The temple complex, with its intricately carved sculptures and towering gopurams (gateway towers), attracted pilgrims from across India and beyond, reinforcing Madurai's status as a major religious center. Throughout its history, Madurai served as a focal point for the Pandya dynasty's administration and cultural patronage. The city's significance extended beyond politics to influence the broader cultural and economic landscape of South India. Even as political power shifted over time, Madurai's legacy as a key center of Tamil civilization and its rich cultural heritage continued to shape its historical narrative. Madurai was well known for its cultural contributions to Tamil art, literature, and religion.", "empire": "", "dynasty": "Pandyan dynasty" ,"current_name": "Madurai", "reference":[ "https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Madurai","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 18, "city": "Gauḍa", "year": " 8th to the 12th century CE", "information": "Together with Pataliputra, Gauḍa, which is in modern-day Bengal, was one of the capitals of the Pala dynasty. Gauḍa was made into a major administrative and cultural hub by the Pala dynasty, which ruled from the 8th to the 12th century CE. Around 750 CE, Gopala I established the dynasty, ushering in an era of political stability and flourishing culture in the area. The strategic location of Gauḍa and its significance in cementing the dynasty's authority over Bengal and adjacent areas made it an important capital under the Palas. The city developed into a center for trade, education, and government, which reflected the Palas' focus on patronage of the arts and governance. Buddhism was greatly supported by the Palas, and Gauḍa flourished as a center for Buddhist education and artistic expression, aiding in the Buddhist movement's expansion both locally and globally. The Pala dynasty ruled over northern India, and Gauḍa was an important part of their governmental system. The city was well-known for its thriving trade, which promoted both cultural and economic interaction. Gauḍa's status as a center of learning was further boosted by the Palas' encouragement of education and the arts, which resulted in the founding of numerous monasteries and universities, including the renowned Vikramashila and Nalanda. The importance of Gauḍa during the Pala era highlights its relevance in the political and cultural context of medieval India. The Palas' contributions to the development of the area are reflected in the city's legacy as capital, emphasizing their influence on Bengal's and northern india history and culture.", "empire": "Pala Empire, Gupta Empire", "dynasty": "pala dynasty" ,"current_name": "Gaur", "reference":[ "https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Gau%E1%B8%8Da_(city)","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 19, "city": "Sigal", "year": "70 BCE to 400 CE", "information": "From roughly 70 BCE to 400 CE, the Sakas, often called the Scythians, ruled from their initial capital, Sigal, also spelled Sirkap. Originating in Central Asia, the Sakas were a collection of nomadic tribes who made their way to the Indian subcontinent by overthrowing the Indo-Greek kings and establishing their capital at Sigal, which is now in Pakistan. The Sakas came to dominate the area with the founding of Sigal as their capital. During this time, the Sakas increased their dominance and consolidated their hold over the northwest regions of India. As the Saka Empire evolved from a nomadic way of life to a more established and organized system of government, Sigal became the center of culture and administration. Sigal prospered as a hub of trade and culture during the Sakas. The city's advantageous placement along important trade routes promoted both cross-cultural exchange and economic growth. The syncretic art and architecture of the area are evidence of the Sakas' adoption and assimilation of diverse parts of the local culture during this period. Buddhism was also well-known to have been supported by the Sakas, and Sigal developed into a prominent hub for Buddhist scholarship and art. Up to the Kushan Empire's advent and eventual abolition of the Saka provinces, the Sakas ruled Sigal. The city's importance during the Saka era emphasizes its part in ancient India's political and cultural changes, demonstrating the Sakas' influence on the history and development of the area.", "empire": "Kushan Empire", "dynasty": "" ,"current_name": "Sialkot", "reference":[ "https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Sigal,_Sakastan", "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 20, "city": "Taxila", "year": "70 BCE to 400 CE", "information": "The Sakas, or Scythians, governed from about 70 BCE to 400 CE, with their second city, Taxila, which is located in modern-day Pakistan. After overthrowing the Indo-Greek emperors, a group of nomadic tribes from Central Asia known as the Sakas established their dominion over the Indian subcontinent. They relocated their capital to Taxila, a city with a rich cultural and historical legacy, after first settling in Sigal (Sirkap). By the time the Sakas established Taxila as their capital, it was already a significant hub for trade, education, and culture. The city was a booming economic hub due to its advantageous location on the trade routes that connected India, the Middle East, and Central Asia. The Sakas' choice to invest in Taxila is indicative of their strategic goal to take advantage of the city's cultural and economic importance to increase their authority and sway. Taxila flourished as a hub for trade and cross-cultural exchange under the Sakas. The city's status as a significant trading hub that promoted trade between many areas contributed to its development. As the Sakas adopted regional customs and practices, this time saw the blending of diverse cultural influences. Taxila gained recognition for its syncretic architecture and art, which combined Indian, Persian, and Greek forms. One of the most prominent universities in the ancient world was located at Taxila, which was also a well-known hub of learning. Scholars from all over the world came to this educational institution thanks to the patronage of the Sakas. The city's educational climate aided in the advancement of numerous academic disciplines, including as mathematics, medicine, and as well as philosophy. Up to the Kushan Empire's ascent and eventual annexation of the Saka lands, the Sakas ruled Taxila. The city's importance during the Saka era highlights the Sakas' influence on the history and development of the area and highlights its part in the political, economic, and cultural transformations of ancient India.", "empire": "Saka (Scythian) Empire", "dynasty": "Saka dynasty" ,"current_name": "Taxila", "reference":["https://en.wikipedia.org/wiki/Taxila","https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 21, "city": "Mathura", "year": "70 BCE to 400 CE", "information": "Mathura, which is now in the Indian state of Uttar Pradesh, was the third capital of the Sakas, also known as the Scythians. The Sakas were a nomadic tribe from Central Asia who defeated the Indo-Greek kings to bring their power to the Indian subcontinent, encompassing Mathura. Mathura was a significant city even before the Sakas established it as their capital. Due to its ties to Buddhism and Hinduism, it was a significant hub of both culture and religion. The city of Mathura was already a thriving center of trade, culture, and religion when the Sakas made it their capital. Mathura maintained its status as a key hub for trade and cross-cultural contact during the Saka dynasty. The city's economic development was aided by its advantageous placement on the trade routes that connected the western provinces and the northern plains of India with Central Asia. Tradesmen from all over the world came to Mathura's market to buy textiles, ceramics, and precious stones, among other commodities. The art and architecture of Mathura during the Saka era bears witness to their syncretic attitude to civilization. Indian, Greek, and Central Asian elements were mixed together in the city, especially in the sculptures and coins. During this time, the renowned Mathura school of painting developed. It is distinguished by its distinct style, which blends elements of Central Asian and Hellenistic art with local Indian traditions. Mathura continued to be an important Buddhist and Hindu religious center. By supporting Buddhist temples and stupas, the Sakas helped Buddhism proliferate throughout the area. Since Mathura is the birthplace of Lord Krishna, it continues to be a significant Hindu pilgrimage site. Up to the Gupta Empire's ascent and eventual annexation of the Saka lands, the Sakas ruled Mathura. The city's importance during the Saka era emphasizes its place in ancient India's political, economic, and cultural environment, demonstrating the Sakas' impact on the history and development of the area.", "empire": "Saka (Scythian) Empire", "dynasty": "Saka dynasty" ,"current_name": "Mathura", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Mathura","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 22, "city": "Sagala", "year": "2nd century BC", "information": "Sagala, which is today in Pakistan as Sialkot, served as the Indo-Greek Kingdom's capital. As Alexander the Great's kingdom broke apart, the Indo-Greeks, who came to power about 180 BCE, founded a Hellenistic state on the Indian subcontinent. At the height of their dominance, Sagala served as their capital. Demetrius I established the Indo-Greek Kingdom, which combined Greek and Indian cultures and grew into the Indian subcontinent. During their reign, Sagala developed into a prominent administrative and cultural hub. Due to its advantageous location, the city was able to control important trade routes, which contributed to its economic growth. Sagala flourished under the Indo-Greeks as a centre of trade, education, and culture. Impressive architectural constructions, like as palaces, temples, and marketplaces, were built throughout the city. The combination of There are clear influences of Greek and Indian art in the sculptures, coins, and other artifacts from this era. The Indo-Greeks were distinguished by their coinage, which frequently included multilingual inscriptions and combined Indian and Greek deities. Additionally, sagala was essential to the spread of Buddhism. Buddhism was supported by the Indo-Greek kings, including Menander I, also referred to as Milinda in Buddhist literature. The Milinda Panha's account of Menander's conversion to Buddhism and his conversations with Buddhist experts emphasize the significance of the city as a hub for intellectual and religious discourse. Up to the early decades of the Common Era, when the Kushan Empire rose to prominence and mostly absorbed the Indo-Greek lands, Sagala was ruled by the Indo-Greek people. The importance of the city throughout the Indo-Greek era emphasizes significant part in the political and cultural changes that occurred in ancient India, which are indicative of the influence of the Indo-Greeks on the history and development of the area.", "empire": "Shunga empire, Mauryan Empire", "dynasty": "Indo-Greek dynasty" ,"current_name": "Sialkot", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Sagala","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 23, "city": "Bhinmal", "year": "6th century CE to 8th century CE", "information": "The Gurjara-Pratihara Empire's capital was Bhinmal, in modern-day Rajasthan. By the eighth century CE, Bhinmal had become a major hub of the Gurjara-Pratihara dynasty's dominance, having come to prominence in the sixth century. The Gurjara-Pratihara Empire, which was well-known for its ability to repel Arab invasions, had a significant impact on early medieval India's political and cultural environment. Bhinmal prospered as a significant hub of trade, culture, and education during their administration. Because of its advantageous location, the city was able to exert influence over vital trade routes that linked the Indian subcontinent to Central Asia and the Middle East. Bhinmal's thriving economy and active cultural life provide witness to its wealth during the Gurjara-Pratihara period. The city was well-known for producing high-quality textiles. and its markets were brimming with merchandise from all parts of the world, demonstrating its multicultural nature. Huge supporters of the arts and sciences, the Gurjara-Pratiharas witnessed the construction of magnificent temples and public buildings throughout Bhinmal's lifetime. The eminent mathematician and astronomer Brahmagupta was one of the distinguished academics connected to Bhinmal. His Bhinmal-produced works had a profound effect on astronomy and mathematics in both India and the Islamic world. The Gurjara-Pratihara dynasty ruled Bhinmal until the tenth century, when internal conflicts and outside invasions caused the empire to begin to fall. The history and development of the area were nonetheless influenced by Bhinmal's heritage as a centre of culture and ideas, even in the face of political upheaval. As the Gurjara-Pratihara Empire's capital, Bhinmal stands for an era in early medieval India marked by intellectual excellence, cultural diversity, and economic prosperity. The significance of the city at this period emphasizes the historical and cultural legacies of the Indian subcontinent that the Gurjara-Pratihara dynasty contributed.", "empire": "Gurjara-Pratihara Empire", "dynasty": "Gurjara-Pratihara dynasty" ,"current_name": "Bhinmal", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Bhinmal","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 24, "city": "Jaunpur", "year": "1394 - 1479", "information": "Jaunpur, which is now in the Indian state of Uttar Pradesh, functioned as the capital of the Sharqī dynasty. Malik Sarwar, a former slave who became well-known during the Tughlaq dynasty of the Delhi Sultanate, established the Sharqī dynasty. He proclaimed independence in 1394 and founded the Sharqī Sultanate, capitalizing on Jaunpur. The Sharqī dynasty, which ruled over eastern Uttar Pradesh, was renowned for its contributions to architecture and culture. Jaunpur developed into a prominent center of study and culture during their reign. The city attracted academics, artists, and traders as it prospered economically and culturally. The Sharqī dynasty was a big supporter of architecture, and Jaunpur witnessed the construction of a number of remarkable structures, including as palaces, madrasas, and mosques. The architectural design of This era is distinguished by the distinctive fusion of Indo-Islamic components. The Atala Mosque and the Jama Masjid are two notable Sharqī-era buildings that attest to the architectural legacy of the dynasty. Jaunpur, known as the Shiraz of India due to its academic culture, rose to prominence as a center of study during the Sharqī era as well. The sultans fostered a vibrant intellectual and cultural milieu by building madrasas and supporting academics, poets, and painters. When the Lodi dynasty of the Delhi Sultanate took control of Jaunpur in 1479, the Sharqī dynasty's reign there came to an end. The Sharqī dynasty's legacy persisted in influencing the region's culture and architecture, even in the face of political changes. As the capital of the Sharqī, Jaunpur dynasty, which stands for a time of brilliant architecture and a cultural rebirth in medieval India. The historical significance of the city during this period emphasizes the cultural and intellectual legacies that the Sharqī dynasty contributed to the region", "empire": "", "dynasty": "Sharqī dynasty, Tughlaq dynasty" ,"current_name": "Jaunpur", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Jaunpur,_Uttar_Pradesh","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]}
    ]
}