{
    "points": [ 
        { "no": 1, "city": "Rajgir", "year": "6th century BCE to 460 BCE", "information": "Rajgir, known in ancient times as Girivraj, was the initial capital of the Magadha Empire from the 6th century BCE to 460 BCE. The city's strategic location, surrounded by hills, made it a naturally fortified and significant political and cultural hub , Rajgir served as the first capital of the Magadha Empire, playing a crucial role in the region's political and cultural development., Period: c. 544 BCE – 413 BCE The Haryanka dynasty marked the rise of Magadha as a significant power in ancient India. Bimbisara expanded the kingdom through conquests and alliances, while his son Ajatashatru further fortified Rajgir and expanded the empire. This period also saw the growth of Buddhism and Jainism in the region, Period: c. 413 BCE – 345 BCE Shishunaga initially made Vaishali his capital before moving it back to Rajgir and then to Pataliputra. His reign was characterized by consolidation and stability, maintaining Rajgir's importance ,Period: c. 345 BCE – 322 BCE The Nanda dynasty, known for its administrative efficiency and wealth, eventually shifted the capital to Pataliputra. However, Rajgir's historical and cultural significance remained intact. ", "empire": " Mauryan Empire, Magadha empire", "dynasty": "Haryanka dynasty, Pradyota dynasty ,Shishunaga Dynasty ,Nanda Dynasty, Brihadratha dynasty, " ,"current_name": "Ragir", "reference": ["https://en.wikipedia.org/wiki/List_of_capitals_of_India", "https://en.wikipedia.org/wiki/Rajgir", "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 2, "city": "Pataliputra", "year": "490 BCE", "information": "Pataliputra, formed around 490 BCE, became the capital of the Magadha Empire, succeeding Rajgir. Its strategic location and political importance made it a prominent center throughout several key dynasties. Haryanka Dynasty (c. 544 BCE – 413 BCE) Under the Haryanka dynasty, Ajatashatru moved the capital from Rajgir to Pataliputra, marking its rise as a significant political hub. This move enhanced the strategic and administrative capabilities of the Magadha Empire. Shishunaga Dynasty (c. 413 BCE – 345 BCE) The Shishunaga dynasty further consolidated Pataliputra's status as the capital. Shishunaga ensured the city remained the epicenter of political activity, solidifying its importance in the empire. Nanda Dynasty (c. 345 BCE – 322 BCE) During the Nanda dynasty, Pataliputra flourished as a wealthy and fortified city. Mahapadma Nanda’s centralization and administrative efficiency turned Pataliputra into a critical hub of wealth and power. Maurya Dynasty (c. 322 BCE – 185 BCE) The Maurya dynasty, particularly under Chandragupta Maurya and Ashoka, saw Pataliputra become the heart of a vast empire. It witnessed significant advancements in administration and culture, including the spread of Buddhism under Ashoka’s reign. Pataliputra’s role as the capital of the Magadha Empire under these dynasties underscores its historical significance as a major political, administrative, and cultural center in ancient India.", "empire": "Shishunaga Empire (c.413-345 BCE), Nanda Empire (c.460 or 420 - c.325 BCE), the Maurya Empire (c.320-180 BCE), the Gupta Empire (c.320-550 CE), and the Pala Empire (c.750-1200 CE)", "dynasty": "Nanda dynasty,Maurya dynasty, Gupta dynasty" ,"current_name": "Patna", "reference": [ "https://en.wikipedia.org/wiki/List_of_capitals_of_India", "https://en.wikipedia.org/wiki/Pataliputra", "https://en.wikipedia.org/wiki/List_of_capitals_of_India", " https://en.wikipedia.org/wiki/Pataliputra", "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 3, "city": "Begram and Mathura", "year": "1st century CE to 3rd century CE", "information": "The Kushan Empire established Begram and Mathura as its capitals during the 1st century CE. The Kushan Empire, under rulers like Kanishka the Great, utilized Begram as the summer capital and Mathura as the winter capital, reflecting the empire's vast territorial reach and strategic administrative planning. These capitals played crucial roles in trade, culture, and governance, contributing to the empire's prosperity and influence in Central and South Asia.", "empire": "Kushan Empire", "dynasty": "" ,"current_name": "Mathura", "reference": [ "https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Bagram","https://en.wikipedia.org/wiki/Mathura ","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 4, "city": "Pratishthana Amaravati", "year": "1st century BCE to 3rd century CE", "information": "The Satavahana Empire, which dominated a significant portion of ancient India from the 1st century BCE to the 3rd century CE, had two prominent capitals: Pratishthana and Amaravati. Pratishthana, located in present-day Paithan in Maharashtra, was established as the primary capital around the 1st century BCE. It served as the political and administrative center of the Satavahana Empire, crucial for managing its extensive territory. Amaravati, in present-day Andhra Pradesh, emerged as an important cultural and economic hub around the 2nd century CE. While not the primary capital, Amaravati became a significant center known for its Buddhist stupa and artistic achievements. The choice of these capitals reflects the Satavahana Empire's strategic approach to governance, with Pratishthana serving as the main administrative center and Amaravati enhancing the empire's cultural and economic influence.", "empire": "Satavahana Empire", "dynasty": " ancient Indian dynasty" ,"current_name": "Paithan , Amaravati, Maharashtra", "reference":[ "https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Paithan" ,"https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"] },
        { "no": 5, "city": "Srikakulam, Krishna district", "year": "1st century BCE to the 3rd century CE", "information": "Srikakulam in the Krishna district of present-day Andhra Pradesh as one of its significant capitals. Established around the 1st century BCE, Srikakulam became a key center for administration and governance, particularly for the empire's eastern territories. The strategic selection of Srikakulam as a capital underscores the Satavahana rulers' aim to effectively manage and control their extensive domain. This city not only facilitated administrative efficiency but also played a crucial role in the cultural and economic activities of the region. The establishment of Srikakulam as a capital highlights the Satavahana Empire's intricate planning and its efforts to integrate various parts of its territory into a cohesive and well-governed entity.", "empire": "Satavahana Empire", "dynasty": "Satavahana dynasty, Eastern Ganga Dynasty" ,"current_name": "Srikakulam", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Srikakulam,_Krishna_district" , "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 6, "city": "Kandapura", "year": "4th or 5th century AD", "information": "During the 4th century CE, Kandapura emerged as a significant center of power, becoming the capital of the Ananda Gotrika dynasty. This development marked a pivotal period for the dynasty, as it sought to consolidate its governance and exert control over its territories. By establishing Kandapura as their political and administrative hub, the Ananda Gotrika dynasty demonstrated a strategic approach to centralizing their rule and organizing their domains The establishment of Kandapura as the capital city underscored the dynasty's commitment to effective administration and regional influence. Through this centralized seat of power, the Ananda Gotrika dynasty aimed to streamline their governance, enhance their authority, and ensure efficient management of their territories. This marked a significant milestone in their history, reflecting their efforts to establish a strong and organized empire. While historical records may not provide us with exhaustive details about the broader empire, the rise of Kandapura in the 4th century CE serves as a testament to the dynasty's astute political maneuvering and their deliberate pursuit of administrative cohesion. By designating Kandapura as their capital, the Ananda Gotrika dynasty signaled their ambition to govern with authority and to exert control over the regions under their rule. In light of these historical circumstances, it is evident that the Ananda Gotrika dynasty's establishment of Kandapura as their capital city represented a pivotal moment in their quest for centralized governance and regional dominance. Their strategic approach to administration during this era highlights their dedication to consolidating power and organizing their territories effectively.", "empire": "", "dynasty": "Ananda Gotrika dynasty" ,"current_name": "Kanchipuram", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Chejerla,_Palnadu_district","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 7, "city": "Rajahmundry", "year": "7th century to the 12th century CE ", "information": "Imagine Rajahmundry, a bustling city that was once the capital of both the Eastern Chalukya Kingdom and the Reddi Kingdom. This place was a real power player in the political and administrative history of those empires. Let's dive into this fascinating tale! Back in the 8th century CE, the Eastern Chalukya Kingdom saw something special in Rajahmundry. They thought, So, they established it as a prominent center for governance and cultural development. You can just imagine the hustle and bustle of the city, with people working hard to consolidate the kingdom's power in the region. It must have been an exciting time! Fast forward a few centuries to the 14th century CE, and Rajahmundry finds itself in the spotlight once again. This time, it becomes the capital of the Reddi Kingdom. The Reddi rulers saw the importance of this city and decided to make it their administrative hub. Can you picture the grand buildings and busy streets, filled with officials and bureaucrats running around, making sure everything was in order? It was like the heartbeat of the kingdom! Throughout these periods, Rajahmundry was not just a city; it was a symbol of power and influence. Its status as a capital city highlighted its strategic significance and its vital role in the governance and cultural landscape of these dynasties. It was a place where decisions were made, where policies were shaped, and where the history of these empires was written. So, let's take a moment to appreciate the rich history of Rajahmundry and the important role it played in the rise and fall of these mighty kingdoms. It's a reminder that even cities have stories to tell, and Rajahmundry has certainly left its mark on the pages of history.", "empire": "The Eastern Chalukya", "dynasty": "Reddi dynasty" ,"current_name": "Rajahmundry", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Rajahmundry","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 8, "city": "Vangipuram or Peddavegi", "year": " 3rd century CE", "information": "Imagine standing in the vibrant city of Vangipuram, a place that holds a rich history of political power and administrative prowess. Back in the 3rd century CE, the Salankayana dynasty recognized the potential of this city and chose it as their capital. They saw Vangipuram as the perfect spot to establish their authority, manage their territories, and strengthen their rule. It became the beating heart of their political activities and the center of their governance. Centuries later, around the 7th century CE, the Eastern Chalukya Kingdom rose to prominence and took over Vangipuram as one of their capitals. The Eastern Chalukyas were known for their administrative skills and love for culture, and they saw Vangipuram as a city with immense potential. They built upon the existing infrastructure, further developing Vangipuram as a bustling administrative hub. The city flourished under their rule, witnessing remarkable growth in both cultural and economic aspects. It's fascinating to see how Vangipuram remained an important capital for different dynasties over the centuries. The fact that both the Salankayana dynasty and the Eastern Chalukya Kingdom recognized its strategic significance speaks volumes about the city's enduring importance. It demonstrates how historical capitals like Vangipuram could adapt to the changing needs of different ruling powers, leaving behind a legacy of power and influence that still resonates today.", "empire": "", "dynasty": "Salankayana dynasty" ,"current_name": "Vangipuram and Peddavegi", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Vangipuram","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 9, "city": "Vijayapuri South, Nagarjunakonda", "year": "3rd and 4th centuries CE", "information": "Imagine stepping into the ancient city of Vijayapuri South, also known as Nagarjunakonda, where history comes alive. This city served as the capital of the Andhra Ikshvakus dynasty, a powerful ruling force in ancient India. It's incredible to think that this place was once the epicenter of political power, administration, and culture. Around the early 3rd century CE, the Andhra Ikshvakus decided to establish their capital in Vijayapuri South. This decision marked a turning point for the city and the dynasty. As you wander through the ruins and remnants of the past, you can almost feel the vibrancy and growth that once thrived here. Nagarjunakonda was not just a political hub but also a center of knowledge and spirituality. Buddhist teachings and culture flourished within its boundaries, evident from the majestic stupas, monasteries, and inscriptions that still stand today. The city's strategic location along the Krishna River made it an ideal spot for trade and communication, further boosting its significance. The Andhra Ikshvakus embraced Vijayapuri South not only as a seat of power but also as a place to nurture and promote their cultural heritage. They were dedicated to supporting Buddhism and other cultural activities, leaving a lasting impact on the city's legacy. As you explore the remnants of this ancient capital, you can't help but marvel at the Andhra Ikshvakus' strategic and cultural influence. Vijayapuri South stands as a testament to their vision and the vibrant history of the region.", "empire": "Ikshvaku Empire", "dynasty": "Ikshvaku dynasty" ,"current_name": "Nagarjuna Sagar", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Nagarjunakonda","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 10, "city": "Kalinganagara", "year": "5th century CE", "information": "Kalinganagara, or Mukhalingam as it is known today, played a fascinating role as the capital of the Eastern Ganga dynasty in eastern India. The Eastern Gangas rose to prominence around the 5th century CE and made Kalinganagara their power hub for all things political, administrative, and cultural. Imagine a bustling city filled with vibrant markets, where traders from different regions converged to exchange goods and ideas. Kalinganagara thrived as a center of economic activity, benefiting from its strategic location along important trade routes. The city's streets were alive with the sounds of merchants haggling and the aroma of exotic spices filling the air. But Kalinganagara was not just about commerce; it was a place where art and religion flourished. The Eastern Gangas were great patrons of Hinduism, particularly the worship of Vishnu and Shiva. Temples dedicated to these deities adorned the city, their intricate sculptures and carvings mesmerizing all who visited. The echoes of devotional chants and the fragrance of incense wafted through the temple corridors, creating a spiritual aura that enveloped the capital. The Eastern Ganga dynasty's passion for art and architecture left an indelible mark on Kalinganagara. The remnants of their magnificent temples and sculptures still captivate visitors today, transporting them back to a time when creativity and devotion thrived. In essence, Kalinganagara was more than just a capital city; it was a vibrant tapestry woven with the threads of trade, culture, and spirituality. Its rise as the center of the Eastern Ganga dynasty showcased their vision for a prosperous and culturally rich empire. The legacy of Kalinganagara lives on, reminding us of the enduring impact that great civilizations can have on the world.", "empire": "", "dynasty": "easten ganga dynasty" ,"current_name": "Mukhalingam", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Mukhalingam","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 11, "city": "Kannauj", "year": "April 606 -c.647 CE", "information": "Kannauj, located in present-day Uttar Pradesh, holds a significant place in Indian history as the capital of both the empire of Harshavardhana and the Pratihara dynasty. During the early 7th century, Harshavardhana established Kannauj as his capital, leading to a period of cultural and political consolidation in northern India. Scholars, poets, and religious leaders flocked to Kannauj, making it a center of learning, religion, and administration. Following Harshavardhana's reign, Kannauj experienced a period of decline until the rise of the Pratihara dynasty in the 8th century. The Pratiharas chose Kannauj as their capital, revitalizing its status as a significant political and cultural hub. Known for their military prowess and administrative skills, the Pratiharas used Kannauj to control the Gangetic plains and extend their influence over northern India. This era witnessed a resurgence in architectural and cultural activities, with the construction of temples and other monuments. Kannauj's strategic location along the Ganges River played a crucial role in its prominence. It facilitated trade and commerce, connecting the northern plains to other parts of the Indian subcontinent. As a capital city, Kannauj served as an administrative center and a catalyst for cultural and intellectual growth. Its influence extended beyond its immediate surroundings, shaping the broader historical and cultural landscape of ancient India.", "empire": "Harshavardhana's empire", "dynasty": "Pushyabhuti dynasty, Pratihara dynasty" ,"current_name": "Kannauj", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Kannauj","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 12, "city": "Manyakheta, Avanti", "year": "8th and 9th centuries CE", "information": "Manyakheta and Avanti held great significance as capitals during the rule of the Rashtrakuta dynasty and the Pratihara Empire, respectively. The Rashtrakutas, who emerged as a prominent power in the 8th century CE, designated Manyakheta, situated in present-day Karnataka, as the hub of their political and administrative activities. This decision marked a period of remarkable growth and consolidation for the Rashtrakutas, renowned for their military prowess, extensive trade networks, and patronage of the arts and culture. Manyakheta thrived as the capital, enabling the dynasty to exert its influence over vast territories across the Indian subcontinent. Similarly, Avanti, also known as Ujjain, served as the capital of the Pratihara Empire during its zenith in the 8th and 9th centuries CE. Located in present-day Madhya Pradesh, Avanti played a vital role in the administration, cultural development, and commerce of the empire. The strategic positioning of Avanti facilitated control over crucial trade routes, empowering the Pratiharas to maintain their dominance over northern and central India. The choices of Manyakheta and Avanti as capitals exemplify the strategic and cultural significance these cities held in ancient Indian empires. They symbolize the Rashtrakutas' and Pratiharas' pursuit of consolidating their power, fostering cultural progress, and effectively managing their vast domains.", "empire": "Pratihara Empire", "dynasty": " Pradyota dynasty, Rashtrakuta dynasty" ,"current_name": "Mankhed , Ujjain", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Malkheda" ,"https://en.wikipedia.org/wiki/Avanti_(region)","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 13, "city": "Gadhipur", "year": " 4th to the 6th century CE", "information": "An important historical site in modern-day India, Gadhipur served as the capital of the Jamwal rulers Gaadhi and Vishvamitra as well as the Gupta dynasty's administrative hub. The Gupta dynasty is well-known for its outstanding contributions to Indian culture, science, and administration. It ruled from about the fourth to the sixth century CE. Gadhipur played a significant role as the empire's administrative hub, even though Pataliputra (present-day Patna) was the principal city of the Gupta Empire. The city played a vital role in the Gupta administration, helping to oversee the empire's vast lands and foster its intellectual and cultural developments. The historical importance of Gadhipur stems from its function as the capital of the Jamwal monarchs Gaadhi and Vishvamitra. An ancient dynasty called the Jamwals established A significant center of politics and culture is Gadhipur. The city's renown during this time precedes the Gupta dynasty, and it is a testament to its significance for both cultural advancement and regional governance. The legendary and historical accounts of ancient India are credited to the Jamwal monarchs, among them Gaadhi and Vishvamitra. Gadhipur has been an important administrative hub and strategic position throughout its history. During the Gupta era, the city's role in government persisted in bolstering the stability and expansion of the empire. Gadhipur's continued relevance as a key place in ancient Indian history, connecting multiple historical epochs and representing the evolution of regional power and culture, is highlighted by the change from the Jamwal period to the Gupta rule.", "empire": "", "dynasty": "Gupta dynasty, Jamwal dynasty" ,"current_name": "Gadhipur", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Ghazipur","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 14, "city": "Karur", "year": "3rd century BCE to the 12th century CE", "information": "One of the major Dravidian kingdoms in South India, the Chera dynasty, had its capital city, Karur, in modern-day Tamil Nadu. Early in its history, the Chera dynasty—which ruled from roughly the third century BCE to the twelfth century CE—established Karur as its capital. The city was an important hub for administration and trade because of its advantageous placement along the trade routes that connected South India's interior to the western coast. Karur was an important focus of cultural and commercial activity as well as politics during the Chera kingdom. The city was essential to the Cheras' attempts to control their vast lands and center their power. Karur's significance is emphasized by its function in promoting trade, both domestically in South India and internationally, particularly trade with Southeast Asia and the Roman Empire. Karur's cultural vibrancy was enhanced by the patronage of many arts, literature, and religious organizations by the Chera kings, who included prominent rulers like Cheran Senguttuvan. Ancient Tamil literature also highlights the importance of the city, frequently referring to Karur as a vibrant hub of political and cultural activity. The Chera dynasty's administration shifted its focus throughout time, as evidenced by the capital moving to other cities like Vanci or Kodungallur, but Karur's early position as the capital highlights the city's fundamental significance in the history of the empire. Its heritage continues to provide witness to the Cheras' historical and cultural impact across South India.", "empire": "", "dynasty": "Chera dynasty" ,"current_name": "Karur", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Karur","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 15, "city": "Dharapuram", "year": "3rd century CE to the 13th century CE", "information": "The capital of Kongu Nadu, a significant area in ancient South India, was Dharapuram, which is now in Tamil Nadu. Approximately from the third to the thirteenth century CE, the Kongu Nadu region—which was important historically—established Dharapuram as its capital. Over time, the Early Cholas, Cheras, and Kongu Cholas were among the dynasties that dominated the Kongu Nadu region. The capital's function emphasizes the city's pivotal role in administering and dominating the Kongu Nadu region, which was renowned for its thriving agricultural sector and advantageous placement along important trade routes. Dharapuram developed into a significant administrative and commercial hub while serving as the capital, aiding in the consolidation of authority and growth in Kongu Nadu. The importance of the city is demonstrated by its support for regional governance, resource management, and trade facilitation. The capital of Dharapuram was chosen to highlight the city's strategic significance as well as its contribution to the historical and cultural advancement of Kongu Nadu. The region's historical significance in ancient South Indian history is highlighted by its status as a capital city.", "empire": " Kongu Nadu", "dynasty": "Cheras, Western Ganga Dynasty" ,"current_name": "Dharapuram", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Dharapuram","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 16, "city": "Puhar", "year": "3rd century BCE", "information": "The Early Cholas were a prominent South Indian dynasty, with their capital city being Puhar, which is now in Tamil Nadu. Puhar became the capital of the Early Chola dynasty, which began to dominate in the third century BCE. Puhar, which is well-known for its advantageous Coromandel Coast position, developed into a crucial center for Early Chola administration, trade, and culture. The Early Cholas' control over trade routes and maritime activity was made easier by Puhar's status as the region's capital, which increased their wealth and clout. The city's growth as a hub for trade and cultural events, connected to other regions of India and Southeast Asia by its port, is indicative of its prominence. When the Early Chola era began and continued till Puhar played a crucial role in strengthening Chola authority and fostering regional prosperity during the Middle Chola emergence in the ninth century CE. The city's strategic significance, administrative function during the Early Cholas, and regional influence are all highlighted by its status as a capital.", "empire": "Chola Kings and Emperors", "dynasty": " Early Chola dynasty" ,"current_name": "Poompuhar", "reference":[ "https://en.wikipedia.org/wiki/List_of_capitals_of_India" ,"https://en.wikipedia.org/wiki/Puhar,_Mayiladuthurai","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 17, "city": "Madurai", "year": "6th century BCE", "information": "Madurai, an ancient city in Tamil Nadu, was a central capital for the Pandya dynasty, which played a significant role in South India's history. The Pandya dynasty, one of the oldest Tamil dynasties, established Madurai as its capital around the 6th century BCE. This period marked the beginning of Madurai's prominence as a major political, cultural, and economic center in the region. Under the Pandyas, Madurai became a vibrant hub of administration and trade. The city's location, strategically positioned near key trade routes, facilitated its growth as a commercial powerhouse. It became a focal point for maritime trade, linking South India with other regions, including the Arabian Peninsula and Southeast Asia. This trade network brought considerable wealth to the city and bolstered its economic importance. Culturally, Madurai was renowned for its contributions to Tamil literature, arts, and religion. The Meenakshi Amman Temple, a magnificent architectural marvel dedicated to the goddess Meenakshi, became a symbol of the city's religious and cultural significance. The temple complex, with its intricately carved sculptures and towering gopurams (gateway towers), attracted pilgrims from across India and beyond, reinforcing Madurai's status as a major religious center. Throughout its history, Madurai served as a focal point for the Pandya dynasty's administration and cultural patronage. The city's significance extended beyond politics to influence the broader cultural and economic landscape of South India. Even as political power shifted over time, Madurai's legacy as a key center of Tamil civilization and its rich cultural heritage continued to shape its historical narrative. Madurai was well known for its cultural contributions to Tamil art, literature, and religion.", "empire": "", "dynasty": "Pandyan dynasty" ,"current_name": "Madurai", "reference":[ "https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Madurai","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 18, "city": "Gauḍa", "year": " 8th to the 12th century CE", "information": "Together with Pataliputra, Gauḍa, which is in modern-day Bengal, was one of the capitals of the Pala dynasty. Gauḍa was made into a major administrative and cultural hub by the Pala dynasty, which ruled from the 8th to the 12th century CE. Around 750 CE, Gopala I established the dynasty, ushering in an era of political stability and flourishing culture in the area. The strategic location of Gauḍa and its significance in cementing the dynasty's authority over Bengal and adjacent areas made it an important capital under the Palas. The city developed into a center for trade, education, and government, which reflected the Palas' focus on patronage of the arts and governance. Buddhism was greatly supported by the Palas, and Gauḍa flourished as a center for Buddhist education and artistic expression, aiding in the Buddhist movement's expansion both locally and globally. The Pala dynasty ruled over northern India, and Gauḍa was an important part of their governmental system. The city was well-known for its thriving trade, which promoted both cultural and economic interaction. Gauḍa's status as a center of learning was further boosted by the Palas' encouragement of education and the arts, which resulted in the founding of numerous monasteries and universities, including the renowned Vikramashila and Nalanda. The importance of Gauḍa during the Pala era highlights its relevance in the political and cultural context of medieval India. The Palas' contributions to the development of the area are reflected in the city's legacy as capital, emphasizing their influence on Bengal's and northern india history and culture.", "empire": "Pala Empire, Gupta Empire", "dynasty": "pala dynasty" ,"current_name": "Gaur", "reference":[ "https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Gau%E1%B8%8Da_(city)","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 19, "city": "Sigal", "year": "70 BCE to 400 CE", "information": "From roughly 70 BCE to 400 CE, the Sakas, often called the Scythians, ruled from their initial capital, Sigal, also spelled Sirkap. Originating in Central Asia, the Sakas were a collection of nomadic tribes who made their way to the Indian subcontinent by overthrowing the Indo-Greek kings and establishing their capital at Sigal, which is now in Pakistan. The Sakas came to dominate the area with the founding of Sigal as their capital. During this time, the Sakas increased their dominance and consolidated their hold over the northwest regions of India. As the Saka Empire evolved from a nomadic way of life to a more established and organized system of government, Sigal became the center of culture and administration. Sigal prospered as a hub of trade and culture during the Sakas. The city's advantageous placement along important trade routes promoted both cross-cultural exchange and economic growth. The syncretic art and architecture of the area are evidence of the Sakas' adoption and assimilation of diverse parts of the local culture during this period. Buddhism was also well-known to have been supported by the Sakas, and Sigal developed into a prominent hub for Buddhist scholarship and art. Up to the Kushan Empire's advent and eventual abolition of the Saka provinces, the Sakas ruled Sigal. The city's importance during the Saka era emphasizes its part in ancient India's political and cultural changes, demonstrating the Sakas' influence on the history and development of the area.", "empire": "Kushan Empire", "dynasty": "" ,"current_name": "Sialkot", "reference":[ "https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Sigal,_Sakastan", "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 20, "city": "Taxila", "year": "70 BCE to 400 CE", "information": "The Sakas, or Scythians, governed from about 70 BCE to 400 CE, with their second city, Taxila, which is located in modern-day Pakistan. After overthrowing the Indo-Greek emperors, a group of nomadic tribes from Central Asia known as the Sakas established their dominion over the Indian subcontinent. They relocated their capital to Taxila, a city with a rich cultural and historical legacy, after first settling in Sigal (Sirkap). By the time the Sakas established Taxila as their capital, it was already a significant hub for trade, education, and culture. The city was a booming economic hub due to its advantageous location on the trade routes that connected India, the Middle East, and Central Asia. The Sakas' choice to invest in Taxila is indicative of their strategic goal to take advantage of the city's cultural and economic importance to increase their authority and sway. Taxila flourished as a hub for trade and cross-cultural exchange under the Sakas. The city's status as a significant trading hub that promoted trade between many areas contributed to its development. As the Sakas adopted regional customs and practices, this time saw the blending of diverse cultural influences. Taxila gained recognition for its syncretic architecture and art, which combined Indian, Persian, and Greek forms. One of the most prominent universities in the ancient world was located at Taxila, which was also a well-known hub of learning. Scholars from all over the world came to this educational institution thanks to the patronage of the Sakas. The city's educational climate aided in the advancement of numerous academic disciplines, including as mathematics, medicine, and as well as philosophy. Up to the Kushan Empire's ascent and eventual annexation of the Saka lands, the Sakas ruled Taxila. The city's importance during the Saka era highlights the Sakas' influence on the history and development of the area and highlights its part in the political, economic, and cultural transformations of ancient India.", "empire": "Saka (Scythian) Empire", "dynasty": "Saka dynasty" ,"current_name": "Taxila", "reference":["https://en.wikipedia.org/wiki/Taxila","https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 21, "city": "Mathura", "year": "70 BCE to 400 CE", "information": "Mathura, which is now in the Indian state of Uttar Pradesh, was the third capital of the Sakas, also known as the Scythians. The Sakas were a nomadic tribe from Central Asia who defeated the Indo-Greek kings to bring their power to the Indian subcontinent, encompassing Mathura. Mathura was a significant city even before the Sakas established it as their capital. Due to its ties to Buddhism and Hinduism, it was a significant hub of both culture and religion. The city of Mathura was already a thriving center of trade, culture, and religion when the Sakas made it their capital. Mathura maintained its status as a key hub for trade and cross-cultural contact during the Saka dynasty. The city's economic development was aided by its advantageous placement on the trade routes that connected the western provinces and the northern plains of India with Central Asia. Tradesmen from all over the world came to Mathura's market to buy textiles, ceramics, and precious stones, among other commodities. The art and architecture of Mathura during the Saka era bears witness to their syncretic attitude to civilization. Indian, Greek, and Central Asian elements were mixed together in the city, especially in the sculptures and coins. During this time, the renowned Mathura school of painting developed. It is distinguished by its distinct style, which blends elements of Central Asian and Hellenistic art with local Indian traditions. Mathura continued to be an important Buddhist and Hindu religious center. By supporting Buddhist temples and stupas, the Sakas helped Buddhism proliferate throughout the area. Since Mathura is the birthplace of Lord Krishna, it continues to be a significant Hindu pilgrimage site. Up to the Gupta Empire's ascent and eventual annexation of the Saka lands, the Sakas ruled Mathura. The city's importance during the Saka era emphasizes its place in ancient India's political, economic, and cultural environment, demonstrating the Sakas' impact on the history and development of the area.", "empire": "Saka (Scythian) Empire", "dynasty": "Saka dynasty" ,"current_name": "Mathura", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Mathura","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 22, "city": "Sagala", "year": "2nd century BC", "information": "Sagala, which is today in Pakistan as Sialkot, served as the Indo-Greek Kingdom's capital. As Alexander the Great's kingdom broke apart, the Indo-Greeks, who came to power about 180 BCE, founded a Hellenistic state on the Indian subcontinent. At the height of their dominance, Sagala served as their capital. Demetrius I established the Indo-Greek Kingdom, which combined Greek and Indian cultures and grew into the Indian subcontinent. During their reign, Sagala developed into a prominent administrative and cultural hub. Due to its advantageous location, the city was able to control important trade routes, which contributed to its economic growth. Sagala flourished under the Indo-Greeks as a centre of trade, education, and culture. Impressive architectural constructions, like as palaces, temples, and marketplaces, were built throughout the city. The combination of There are clear influences of Greek and Indian art in the sculptures, coins, and other artifacts from this era. The Indo-Greeks were distinguished by their coinage, which frequently included multilingual inscriptions and combined Indian and Greek deities. Additionally, sagala was essential to the spread of Buddhism. Buddhism was supported by the Indo-Greek kings, including Menander I, also referred to as Milinda in Buddhist literature. The Milinda Panha's account of Menander's conversion to Buddhism and his conversations with Buddhist experts emphasize the significance of the city as a hub for intellectual and religious discourse. Up to the early decades of the Common Era, when the Kushan Empire rose to prominence and mostly absorbed the Indo-Greek lands, Sagala was ruled by the Indo-Greek people. The importance of the city throughout the Indo-Greek era emphasizes significant part in the political and cultural changes that occurred in ancient India, which are indicative of the influence of the Indo-Greeks on the history and development of the area.", "empire": "Shunga empire, Mauryan Empire", "dynasty": "Indo-Greek dynasty" ,"current_name": "Sialkot", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Sagala","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 23, "city": "Bhinmal", "year": "6th century CE to 8th century CE", "information": "The Gurjara-Pratihara Empire's capital was Bhinmal, in modern-day Rajasthan. By the eighth century CE, Bhinmal had become a major hub of the Gurjara-Pratihara dynasty's dominance, having come to prominence in the sixth century. The Gurjara-Pratihara Empire, which was well-known for its ability to repel Arab invasions, had a significant impact on early medieval India's political and cultural environment. Bhinmal prospered as a significant hub of trade, culture, and education during their administration. Because of its advantageous location, the city was able to exert influence over vital trade routes that linked the Indian subcontinent to Central Asia and the Middle East. Bhinmal's thriving economy and active cultural life provide witness to its wealth during the Gurjara-Pratihara period. The city was well-known for producing high-quality textiles. and its markets were brimming with merchandise from all parts of the world, demonstrating its multicultural nature. Huge supporters of the arts and sciences, the Gurjara-Pratiharas witnessed the construction of magnificent temples and public buildings throughout Bhinmal's lifetime. The eminent mathematician and astronomer Brahmagupta was one of the distinguished academics connected to Bhinmal. His Bhinmal-produced works had a profound effect on astronomy and mathematics in both India and the Islamic world. The Gurjara-Pratihara dynasty ruled Bhinmal until the tenth century, when internal conflicts and outside invasions caused the empire to begin to fall. The history and development of the area were nonetheless influenced by Bhinmal's heritage as a centre of culture and ideas, even in the face of political upheaval. As the Gurjara-Pratihara Empire's capital, Bhinmal stands for an era in early medieval India marked by intellectual excellence, cultural diversity, and economic prosperity. The significance of the city at this period emphasizes the historical and cultural legacies of the Indian subcontinent that the Gurjara-Pratihara dynasty contributed.", "empire": "Gurjara-Pratihara Empire", "dynasty": "Gurjara-Pratihara dynasty" ,"current_name": "Bhinmal", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Bhinmal","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 24, "city": "Jaunpur", "year": "1394 - 1479", "information": "Jaunpur, which is now in the Indian state of Uttar Pradesh, functioned as the capital of the Sharqī dynasty. Malik Sarwar, a former slave who became well-known during the Tughlaq dynasty of the Delhi Sultanate, established the Sharqī dynasty. He proclaimed independence in 1394 and founded the Sharqī Sultanate, capitalizing on Jaunpur. The Sharqī dynasty, which ruled over eastern Uttar Pradesh, was renowned for its contributions to architecture and culture. Jaunpur developed into a prominent center of study and culture during their reign. The city attracted academics, artists, and traders as it prospered economically and culturally. The Sharqī dynasty was a big supporter of architecture, and Jaunpur witnessed the construction of a number of remarkable structures, including as palaces, madrasas, and mosques. The architectural design of This era is distinguished by the distinctive fusion of Indo-Islamic components. The Atala Mosque and the Jama Masjid are two notable Sharqī-era buildings that attest to the architectural legacy of the dynasty. Jaunpur, known as the Shiraz of India due to its academic culture, rose to prominence as a center of study during the Sharqī era as well. The sultans fostered a vibrant intellectual and cultural milieu by building madrasas and supporting academics, poets, and painters. When the Lodi dynasty of the Delhi Sultanate took control of Jaunpur in 1479, the Sharqī dynasty's reign there came to an end. The Sharqī dynasty's legacy persisted in influencing the region's culture and architecture, even in the face of political changes. As the capital of the Sharqī, Jaunpur dynasty, which stands for a time of brilliant architecture and a cultural rebirth in medieval India. The historical significance of the city during this period emphasizes the cultural and intellectual legacies that the Sharqī dynasty contributed to the region", "empire": "", "dynasty": "Sharqī dynasty, Tughlaq dynasty" ,"current_name": "Jaunpur", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Jaunpur,_Uttar_Pradesh","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 25, "city": "Agra", "year": "1506", "information": "Sultan Sikandar Lodi established Agra as the capital of the Lodi dynasty, which ruled from 1488 to 1517. The final dynasty to rule the Delhi Sultanate was the Lodi dynasty, which originated in Afghanistan and ruled over northern India in the late 15th and early 16th centuries. When Sultan Sikandar Lodi chose to relocate his capital from Delhi to Agra in 1506, the political climate in the area underwent a dramatic change. Realizing the strategic and commercial benefits of Agra, Sultan Sikandar Lodi chose to relocate his capital from Delhi to this then-new city in 1506. Because of its strategic location beside the Yamuna River, Agra was well-suited for trade, agriculture, and military supplies. Sikandar Lodi sought to achieve his goals by making Agra the capital. in order to improve administration and solidify his hold on the empire's northern areas. Agra was a sleepy town until Sikandar Lodi made it into a thriving metropolis. The Sultan built a number of important structures, such as palaces, mosques, and forts, which helped pave the way for Agra's rise to prominence during the Mughal era. Under the Lodi kings, the city also developed into a hub of scholarship and intellectual activity, with academics, poets, and painters receiving support. During Sikandar Lodi's rule, Agra's position as the capital was further cemented, and it maintained its political significance long after the Lodi dynasty was overthrown. The city started to change into one of the most important cities in India when it was made the capital. history, eventually emerging as the focal point of the Mughal Empire under the leadership of Shah Jahan, Jahangir, and Akbar.", "empire": "", "dynasty": "Lodhi dynasty" ,"current_name": "Agra", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Agra","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 26, "city": "Vijayanagara", "year": "14th to 16th century", "information": "One of the most powerful and affluent empires in South Indian history, the Vijayanagara Empire had its capital city at Vijayanagara, which was founded in the early 14th century. Around 1336, the Sangama dynasty's brothers Harihara I and Bukka Raya I constructed the city. Their objectives were to establish a robust defense against the Delhi Sultanate's incursions and to reinstate Hindu governance in the Deccan. In no time at all, Vijayanagara expanded into a vast metropolis that served as the epicenter of an empire spanning the Deccan and South India. The city was renowned for its magnificent temples, busy bazaars, and striking architecture, all of which reflected the wealth and might of the empire. The Vijayanagara emperors fostered a vibrant cultural environment by generously supporting literature, the arts, and religion.an atmosphere that attracted international traders, academics, and artists. Vijayanagara's vast population was sustained by the water from the Tungabhadra River, which was strategically positioned along the city's banks. But by 1585, the city had been abandoned, mostly as a result of a number of events, such as the Vijayanagara armies' crushing defeat in the Battle of Talikota in 1565 and the city's subsequent sacking. Its decline was also exacerbated by problems like the dwindling water supply and the challenges associated with maintaining the extensive metropolitan infrastructure. Long after his downfall, however, Vijayanagara's imprint persisted in shaping politics and culture in South India. The city's remains, especially in the Hampi region, serve as a reminder of the splendor and genius of the Vijayanagara Empire's architecture. The history of the city, including its rise and fall, sheds light on the difficulties involved in creating an empire in medieval India.", "empire": "Vijayanagara Empire", "dynasty": "" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 27, "city": "Patna", "year": "1538/1540 and 1556", "information": "Between 1538/1540 and 1545, Patna—formerly known as Pataliputra—became the imperial capital of Sher Shah Suri. The Suri Empire was founded in 1540 when Sher Shah, formerly known as Farid Khan, overthrew Humayun, the Mughal Emperor. He chose Patna because of its advantageous location along the Ganges River, which made it a major centre for military supply, trade, and administration. Patna was rejuvenated and enlarged during Sher Shah's reign, demonstrating his administrative prowess. Building the Grand Trunk Road, instituting a postal system, and introducing a unified currency all contributed to the expansion of his empire. Following Sher Shah's demise, the Suri Empire persisted until 1556, at which point the Mughals took back power. Patna flourished under the Mughals, when it was the capital of Bihar Subah. Bihar Subah, one of the empire’s provinces. The city’s strategic importance and economic significance made it a key center of administration and trade under both the Suri and Mughal empires. Patna’s history during these periods underscores its vital role in medieval Indian politics and governance.", "empire": "Sher Shah Suri's Empire", "dynasty": "" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 28, "city": "Allahabad", "year": "1599 to 1604", "information": "During the Mughal Empire, Allahabad—now known as Prayagraj—became a significant provincial capital. When Prince Salim, who would later become Emperor Jahangir, made it his headquarters from 1599 to 1604, it rose to great prominence. Allahabad was an important military and administrative hub due to its advantageous location at the meeting point of the Yamuna and Ganges rivers. Salim used the city as a base at this time to build his authority in preparation for taking over from his father, Emperor Akbar. The significance of Allahabad in Mughal politics and governance was highlighted by his selection of the city as his headquarters. Salim's stay in the city sparked important growth and the building of a number of important buildings, including the Allahabad Fort, which is still a well-known monument today. The Mughal Empire made Allahabad a provincial capital, which emphasizes the city's strategic and administrative importance. Under Jahangir's rule, the city's standing was further enhanced, and it kept up its vital position in the governance of the empire. Allahabad's lasting significance in the political and cultural history of northern India is demonstrated by the legacy left by the Mughals.", "empire": "Mughal Empire ", "dynasty": "" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"] },
        { "no": 29, "city": "Budaun", "year": "1211", "information": "One of the most important emperors of the Delhi Sultanate, Sultan Iltutmish, held Budaun, which is now in the Indian state of Uttar Pradesh. After rising through the ranks from being a slave to become the Sultan of Delhi in 1211, Iltutmish founded the Shamsi dynasty, which was a branch of the greater Slave dynasty. About 1211, in the early years of his rule, Iltutmish established Budaun as his capital. The city was deliberately chosen because of its strategic location in northern India, which made it possible for Iltutmish to efficiently administer the Sultanate's growing lands. As a political and military center under his leadership, Budaun provided him with the foundation from which to expand his authority over the Indian subcontinent. Iltutmish is credited with introducing the Iqta system, a system of land revenue administration, and fortifying the Sultanate's military and administrative apparatus. His rule was characterized by a time of relative peace and growth, which prepared the way for the Delhi Sultanate's eventual domination in northern India. Budaun's strategic and historical significance is underscored by its status as the capital during the Iltutmish era. Budaun continued to be an important metropolis in the area, despite the eventual relocation of the capital to Delhi, demonstrating the early stabilization of Muslim power in India. ", "empire": "Sultanate empire", "dynasty": "Shamsi dynasty, Slave dynasty." ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 30, "city": "Kanchipuram", "year": "4th to the 9th centuries", "information": "From the fourth to the ninth century, the Pallava dynasty, which gained prominence in southern India, had its capital at Kanchipuram, a city in modern-day Tamil Nadu. Around the fourth century CE, the Pallavas—who had previously been feudatories under the Satavahanas—became an autonomous force. They established Kanchipuram as their capital, turning it into a significant hub for religion, culture, and politics. Famous Pallava rulers like Narasimhavarman I (630–668 CE) and Mahendravarman I (600–630 CE) oversaw the flourishing city of Kanchipuram, which became a center of architecture and culture. The rock-cut temples and monolithic buildings of Mahabalipuram, which were built during the Pallava dynasty, are well known for their contributions to Dravidian architecture. Kanchipuram evolved become a well-known hub for education and spirituality, drawing Monks, poets, and scholars who gained the moniker City of a Thousand Temples.  The southern Indian region's cultural and religious landscape was greatly influenced by the Pallava dynasty. As the dynasty's capital, Kanchipuram was at the center of this change, symbolizing its might and sway. The city remained an important hub for Hindu scholarship and temple construction, therefore its significance persisted even after the Pallavas' decline.", "empire": "", "dynasty": "Pallava dynasty" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 31, "city": "Thanjavur", "year": "985–1014 CE", "information": "One of the most potent and long-lasting empires in South Indian history, the Chola dynasty, had its capital at Thanjavur, which is now in the state of Tamil Nadu. The Cholas gained notoriety in the ninth century, and Thanjavur became the seat of the empire under the reign of Raja Raja Chola I (985–1014 CE). Under the Cholas, Thanjavur prospered and developed into the political, cultural, and commercial center of the empire. Raja Raja Chola I started work on the Brihadeeswarar Temple at this time. It is now a UNESCO World Heritage site and a symbol of the Chola period's artistic and architectural prowess. The city was a center of Tamil culture, drawing academics, poets, and artists, and it was essential to the growth of of Tamil art and literature. With Thanjavur serving as its capital, the Chola Empire extended its sphere of influence far beyond South India, encompassing Southeast Asia, the Maldives, and Sri Lanka. Even when the Chola empire fell, the city's significance persisted for centuries, making it a permanent representation of the might and legacy of South India. The greatness of the Chola Empire and its contributions to Indian civilization are inextricably linked to Thanjavur's heritage.", "empire": "British Empire, the Vijayanagar Empire, Chola empire", "dynasty": "Mutharaiyar dynasty, the Pandyas, the Madurai Nayaks, the Thanjavur Nayaks, the Thanjavur Marathas and the Chola dynasty." ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 32, "city": "Murshidabad", "year": "1704", "information": "The first Nawab of Bengal, Nawab Murshid Quli Khan, moved the capital from Dhaka to a new city he named Murshidabad in honor of himself in 1704. This action represented the growing independence and power of the Nawabs under the crumbling Mughal Empire, and it was a pivotal point in Bengali history. Aurangzeb, the Mughal emperor, first named Murshid Quli Khan as Bengal's Diwan, or minister of finance. But with time, he solidified his position of authority and essentially took over as Bengal's de facto ruler. Situated on the eastern bank of the Bhagirathi River, Murshidabad rapidly developed into a flourishing hub of politics, commerce, and culture. It rose to become the capital of the Bengal Subah, a political entity including Orissa, Bihar, and Bengal.  The city had economic prosperity under Murshid Quli Khan's rule, with a booming trade in silk, muslin, and other items. Murshidabad's location was more advantageous for administrative control and defense, hence the migration from Dhaka to Murshidabad was also strategically significant. Under succeeding Nawabs, the city continued to serve as the capital of Bengal until the British East India Company seized power during the Battle of Plassey in 1757. Murshid Quli Khan's ascent of Murshidabad is indicative of the growing autonomy of local lords in the latter part of the Mughal era and the significance of the city as a hub of authority in eighteenth-century India.", "empire": "Mughal Empire", "dynasty": "Nasiri dynasty" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 33, "city": "Pune", "year": "1730", "information": "Under the direction of the Peshwa, the Maratha rulers' prime minister, Pune was made the capital of the Maratha Empire in 1730. The Maratha Empire, which was at its height during this time, had a pivotal milestone in its history when the capital was moved to Pune. After establishing their supremacy throughout the Deccan and beyond, the Marathas made Pune the political and administrative hub of their growing empire in an effort to maintain their hold on power. One of the strongest nations in India at the time was the Maratha Empire, which was ruled by the Bhosale family. It had successfully resisted Mughal dominance and had expanded to cover a sizable portion of the country. Pune was chosen as the capital because it was strategically situated in Maratha territory and offered a robust foundation for governing and military operations. Pune became the capital during the reign of Peshwa Baji Rao I, who was instrumental in extending the empire's sphere of influence. The city developed as a center for government, society, and military strategy. Pune also underwent substantial urban development during this time, with the building of the Shaniwar Wada, the Peshwas' seat. In summation, during the height of the Marathas' dominance in 1730, Pune became the capital of the Maratha Empire under the Bhosale dynasty, symbolizing non-Mughal authority in India.", "empire": "Maratha Empire", "dynasty": "Bhosale dynasty" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 34, "city": "Munger", "year": "4th century CE", "information": "When Mir Qasim Ali, the Nawab of Bengal from 1760 to 1764, relocated his seat of government from Murshidabad to Munger in 1763, Munger became the capital of the Nawab state. This change signaled a pivotal moment in Bengali history and highlighted the Nawab's efforts to solidify his position of authority and elude the British East India Company's pressure. Mir Qasim Ali belonged to the Bengali Nawab dynasty, which governed the province of Bengal Subah within the waning Mughal Empire. Strategic factors played a major role in the relocation to Munger, since the city provided a more defendable position and was less exposed to British military incursions. Munger, on the Ganges River's banks, was ideally situated for both military and administrative dominance. protection. Munger developed into a significant military and administrative hub under Mir Qasim's leadership. But growing tensions with the British East India Company meant that his time as Nawab was brief. After the Battle of Buxar resulted in Mir Qasim's downfall in 1764, Bengal saw a dramatic change in power towards British rule. In conclusion, Munger was the capital of Bengal under Mir Qasim Ali's Nawab from 1763 to 1764. During a turbulent time in the history of the area, it was a vital strategic point and was a part of the Nawab of Bengal dynasty.", "empire": "", "dynasty": "Nawab of Bengal dynasty" ,"current_name": "", "reference": ["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 35, "city": "Daulatabad Fort", "year": "6th century CE", "information": "The capital of the Tughlaq dynasty, which lasted from 1325 until 1351, was relocated from Delhi to Daulatabad, which is now in Maharashtra, in 1327 by Sultan Muhammad ibn Tughluq. His larger administrative and strategic changes, which included this choice, were intended to provide him more control over the enormous and varied lands that made up his empire. As a component of the larger Tughlaq Sultanate, the Tughlaq dynasty was well-known for its aspirational and occasionally divisive policies. In order to consolidate his power and counteract threats originating from the north and the Deccan, Muhammad ibn Tughluq moved the capital. Daulatabad's dry climate and limited water supplies, however, made the relocation arduous and caused great suffering for the locals. Two years later, the In 1329, the capital was relocated back to Delhi because Daulatabad was unsuitable as a long-term administrative hub. Daulatabad is an important historical landmark that reflects the high goals of the Tughlaq dynasty and the difficulties of medieval Indian governance, notwithstanding its brief reign as the capital. The history of the city highlights the difficulties emperors had in overseeing the logistics and administration of their empires.", "empire": "", "dynasty": " Tughlaq dynasty" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 36, "city": "Hanamkonda and Warangal", "year": "1199", "information": "During the 12th and 14th centuries, the Kakatiya dynasty ruled over the southern Indian subcontinent, with its capitals located at Hanamkonda and Warangal. The early 1100s saw the birth of the Kakatiya dynasty, which rose to prominence in the early 12th century. The Kakatiya dynasty's first capital, Hanamkonda, functioned as the political and administrative hub of their early period of reign. King Rudramadevi led the Kakatiyas to relocate their capital to Warangal in 1195, which was a more desirable site from a strategic standpoint. With its strong defenses and strategic location, Warangal offered superior protection and control over the vast lands of the Kakatiya Empire. The Kakatiya dynasty reached the pinnacle of its strength and influence with this act. Notable are the Kakatiyas for their contributions to architecture, which include building the Warangal Fort and a number of temples that showcase the artistic and cultural accomplishments of the dynasty. They ruled until the Delhi Sultanate overthrew the Kakatiya dynasty in the middle of the fourteenth century. The historical significance of Hanamkonda and Warangal lies in their legacy, which highlights the administrative skills and innovative architectural designs of the Kakatiyas in southern India.", "empire": "", "dynasty": "Kakatiya Dynasty" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 37, "city": "Addanki", "year": "1325 AD", "information": "In the fourteenth and fifteenth centuries, the Reddy Kingdom's capital was Addanki, which is now in the state of Andhra Pradesh. The Reddy dynasty, which controlled the Reddy Kingdom from its founding in the early 14th century, was influential in the political and cultural history of the area. Prolaya Vema Reddy, who consolidated power and cemented his dominion circa 1325 CE, formed the dynasty. Under the Reddy dynasty, Addanki emerged as the political and administrative hub of the Reddy Kingdom, and its advantageous location helped the kingdom maintain control over the lands around it. The Reddy dynasty was renowned for its military might and determination to fortify their position against neighboring nations and rising countries. In Addanki, under the Reddy dynasty, there was notable advancements in both architecture and culture, such as the building of temples, forts, and other buildings that demonstrated the kingdom's wealth and capacity for governance. The Reddy Kingdom was a significant regional force in southern India, with influence spanning across portions of modern-day Andhra Pradesh and Telangana. Due to internal strife and outside influences, the Reddy Kingdom started to weaken in the late 15th century and finally fell to the enlarging Vijayanagara Empire. Addanki's historical significance within the Reddy dynasty and its influence on regional history during its heyday are highlighted by its status as the capital.", "empire": "", "dynasty": "Reddy dynasty" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 38, "city": "Cochin", "year": "16th century", "information": "Early in the 16th century, Cochin—now known as Kochi—was for a short while the epicenter of political action. Under the Portuguese Empire's influence, the city rose to prominence in the Indian Ocean commerce network between 1505 and 1510. The Portuguese first made a substantial impact in the area in 1505, when they built a fort in Cochin. This action was a component of their larger plan to safeguard their marine routes and gain control over the lucrative spice trade. Cochin served as the Portuguese colonial administration's actual headquarters in India at this time, which made it a vital center for their trading operations. The Portuguese provided security and advantages in commerce to the Cochin Raja, the native rulers, who at first cooperated with them. But the Portuguese The Portuguese had only brief reign over Cochin, lasting until 1510 when they encountered military setbacks and opposition from rival European countries as well as indigenous groups. Changes in power occurred in the city around 1510, and the Portuguese progressively lost dominance as they turned their attention to other important places in India. In spite of this, Cochin's history was significantly shaped by the Portuguese occupation, which also highlighted the city's significance in the early European-Indian colonial exchanges.", "empire": "", "dynasty": "" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 39, "city": "Old Goa", "year": "1510", "information": "From 1510 to 1843, Old Goa, also called Velha Goa, was a prominent metropolis ruled by the Portuguese. After taking Goa from the Sultan of Bijapur in 1510, the Portuguese made Goa their colonial capital, building Old Goa. This signaled the start of Goa's more than three-century-long Portuguese era. Old Goa developed into a significant hub for trade, business, and Christianity in the Indian Ocean region while it was ruled by the Portuguese. The Portuguese built churches, convents, and administrative structures as the city flourished as a busy port and a center of culture. The most noteworthy constructions from this era are the Se Cathedral and the Basilica of Bom Jesus, which demonstrate the city's importance as a hub for both both commercial and religious endeavors. Old Goa was under Portuguese rule until 1843, when the capital was transferred to Panaji as a result of the area's deteriorating infrastructure and malaria-related health problems. Old Goa, which showcases the architectural and cultural legacies of Portuguese colonial control in India, continues to be a historical site in spite of the relocation. It represents a crucial period of Portuguese influence in India.", "empire": "", "dynasty": " Adil Shahi Dynasty" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 40, "city": "Nova Goa", "year": "1843", "information": "After Old Goa declined, Nova Goa now known as Panaji became the capital of Portuguese India in 1843. Health problems and deteriorating infrastructure in Old Goa forced the shift, and Panaji was selected because of its better location and hygienic circumstances. Until Portuguese sovereignty ended in 1961, the city served as the political and administrative hub of Portuguese India. During the Portuguese rule, Nova Goa became the center of politics, trade, and culture in the area. During this time, the city saw tremendous growth as notable government buildings, churches, and residential neighborhoods were built. In Panaji, the Portuguese founded a thriving colonial society that gained notoriety for its unique fusion of Portuguese and Indian cultural elements. Nova Goa was crucial to the Portuguese colonial empire at this time, promoting trade and defending Portugal's strategic objectives in the Indian Ocean. But as the independence movement gained traction, so did the decolonization movements. Portuguese dominance over Goa ended when India seized the region in 1961. As a result, Nova Goa symbolized the end of Portuguese colonial rule in India and became a part of the newly independent nation while maintaining its rich imperial legacy.", "empire": "", "dynasty": "" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"] },
        { "no": 41, "city": "Pulicat", "year": "1502", "information": "The town of Pulicat, on India's southeast coast, was the seat of government for the Dutch Coromandel twice: from 1610 to 1690 and from 1781 to 1795. Early in the 17th century, the Dutch East India Company established a presence in Pulicat by taking use of the town's advantageous location for trading with the Coromandel Coast. Pulicat developed became a vital hub for the Dutch East India Company's (VOC) trading operations in southern India. The VOC was a significant colonial power. Pulicat prospered as a thriving port and a center for the spice trade during the early era of Dutch domination, making a substantial contribution to the Dutch commercial empire. The Dutch relocated their main office from Pulicat to Chennai (then known as as Madras), indicating changes in political and commerce networks. Still, Pulicat remained significant, and in the last stages of their colonial venture in India, the Dutch restored their administrative presence there from 1781 until 1795. As part of the Treaty of The Hague, the Dutch gave the British East India Company control over its Indian colonies, including Pulicat, in 1795. Following Pulicat's transfer to British sovereignty and subsequent transformation into a more sedate port city while keeping its historical value, this signaled the end of Dutch colonial rule in the region.", "empire": "", "dynasty": "","current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ] },
        { "no": 42, "city": "Nagapatnam", "year": "1799 to 1845", "information": "During British administration, Nagapattinam, on the southeast coast of India, was an important administrative center from 1799 to 1845. During this time, it served as the Tanjore district's capital under the Madras Presidency. With the defeat of Tipu Sultan in the Fourth Anglo-Mysore War, British rule over the region commenced in 1799. As the British East India Company expanded its influence throughout southern India, Nagapattinam was chosen to serve as the district capital of Tanjore because of its strategic port location and historical importance. Under British rule, Nagapattinam grew to become a major center for trade and administration during this time. The city's significance in local governance and trade was emphasized during British rule. The British made use of the port at Nagapattinam to trade and effectively administer the neighboring areas. The city had administrative and infrastructural modifications in line with British colonial principles. A larger administrative reform in the British Madras Presidency took place in 1845 when administrative functions changed and the capital of the Tanjore district was relocated from Nagapattinam to Tanjore (Thanjavur). Nagapattinam remained a significant regional port and cultural hub in spite of this development.", "empire": "", "dynasty": "","current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"] },
        { "no": 43, "city": "Pondicherry", "year": "1674", "information": "Puducherry, formerly known as Pondicherry, served as a major French colonial hub in India. When the French East India Company founded a trade post there in 1674, it signaled the beginning of French involvement in the area and gained significance. In an attempt to establish a solid presence in southern India, the French crowned Pondicherry as the capital of French India, a subcontinent that was a part of the larger French colonial empire. Pondicherry served as the political and administrative center of French India from 1884 to 1954. With its unique French architecture, grid-like street design, and lively cultural influences that mirrored its colonial heritage, the city was painstakingly designed and developed. Pondicherry is a prominent example of French colonial governance because to the administrative, economic, and social policies that the French adopted. urban planning and management. Pondicherry's advantageous location along India's eastern coast made it a crucial port and hub for French trade. Up until 1954, when a vote led to its official integration with India, it remained the center of French rule. Presently, Puducherry preserves its French heritage and serves as a singular reminder of India's colonial past.", "empire": "", "dynasty": "" ,"current_name": "", "reference": ["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 44, "city": "Prayagraj", "year": "1858", "information": "For one day only in 1858, Allahabad—now known as Prayagraj—served as the temporary capital of India. This happened at a critical juncture in Indian history, when the Indian Rebellion of 1857 led to the dissolution of the British East India Company. The British Raj began when the British government assumed direct rule over India. The exact event happened on March 1, 1858, when the British Raj was effectively founded and the East India Company's control was officially abolished by Queen Victoria's proclamation. Allahabad, which was already a prominent administrative hub for the North-Western Provinces, was given the temporary title of Indian capital as part of this shift. This action served as a symbolic signal for the change in administrative authority and the start of direct India is ruled by the crown. The short time Allahabad lasted as capital, however, emphasised the city's significance in British India and its part in the post-rebellion governmental restructuring. Soon after, Calcutta (now Kolkata) was designated as the new capital, while Allahabad remained an important hub for administration and justice under the British Raj until India's independence in 1947.", "empire": "British Empire.", "dynasty": "" , "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 45, "city": "Kolkata", "year": "1772 until 1911", "information": "India's capital during the British Raj was Calcutta (now Kolkata), which held this position from 1772 to 1911. Calcutta was first visited by the British East India Company in 1690, but it wasn't until 1772 that the city was formally recognized as the administrative center of British India. Calcutta's strategic location along the Hooghly River made it an ideal location for the British East India Company, a significant participant in British colonial development, to promote trade and administrative control over the eastern provinces of India. The city's involvement in the military, trade, and administration of the British Raj served to further cement its significance. 1911 saw the relocation of the capital from Calcutta to Delhi as part of a larger plan to centralize administrative oversight and management of India's burgeoning nationalist movements. The political and cultural significance of Delhi, which had long been a significant hub in Indian history, was also meant to be reflected in this decision. During British administration, Calcutta remained a major commercial and cultural centre and is still an important city in India today. Its reign as the capital was characterized by substantial advancements in administration, infrastructure, and cultural institutions.", "empire": "British Empire.", "dynasty": "" ,"reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 46, "city": "Shimla", "year": "1864 - 1947", "information": "Nestled in the foothills of the Himalayas, Shimla became the summer capital of British India by the late 1800s. When Shimla was formally designated as the summer capital in 1864 by Viceroy of India John Lawrence, the shift got underway. The British considered Shimla's mild environment perfect for ruling during the summer season because they were finding it difficult to handle the scorching heat of the Indian plains. The British discovered Shimla's favorable weather and gorgeous scenery early in the 1820s, which marked the beginning of Shimla's ascent to fame. Shimla was a little settlement at first, but the British government found it more appealing after the Hindustan-Tibet Road was built in the 1850s since it made the town more accessible. With time, the village became an important center for the British, who built the Viceregal Lodge and other colonial structures, churches, and administrative buildings. Up to India's independence in 1947, Shimla functioned as the country's summer capital. The town was vital to the management of British India, particularly in the summer months when all government apparatus would relocate there from Delhi or Calcutta. One distinctive aspect of British colonial control was the seasonal migration, which they used to maintain efficiency while evading the brutal Indian heat.", "empire": "British Empire.", "dynasty": "" , "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 47, "city": "Delhi", "year": "1911 - 1931", "information": "King George V of the United Kingdom announced at the opulent Delhi Durbar on December 12, 1911, that Delhi would become the new capital of British India, replacing Calcutta. This choice was crucial because it represented a change in the British Empire's strategy for running India. Delhi was regarded as a potent symbolic option for the new capital because of its rich historical past as the capital of multiple Indian rulers. The choice was driven by multiple considerations. India's eastern city of Calcutta was viewed as being too isolated from the rest of the nation, especially from the northern areas of the country where British influence was strongest. But Delhi was more centrally located and had a rich history as the capital of several Indian empires, including the Mughals. Not long after the proclamation, work on the new capital city in Delhi got underway. The British government sought to build a large, contemporary city that would symbolize the strength and enduring nature of the British Raj in the region selected for the new capital, which was south of the former Mughal metropolis of Delhi. Two renowned British architects, Sir Edwin Lutyens and Sir Herbert Baker, designed the architectural layout. Their plans, which represented British imperial dominance, featured broad avenues, imposing structures, and expansive open areas. Known as New Delhi, the city was formally opened in early 1931 after the government, parliament, and viceroy's buildings (which are now known as Rashtrapati Bhavan) were finished. This signified the official relocation of the British central government. Delhi became the new capital of British India when Calcutta was abandoned. ", "empire": "British Empire.", "dynasty": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]}
    ]
}