{
    "points": [ 
        { "no": 1, "city": "Prayagraj", "year": "1858", "information": "For one day only in 1858, Allahabad—now known as Prayagraj—served as the temporary capital of India. This happened at a critical juncture in Indian history, when the Indian Rebellion of 1857 led to the dissolution of the British East India Company. The British Raj began when the British government assumed direct rule over India. The exact event happened on March 1, 1858, when the British Raj was effectively founded and the East India Company's control was officially abolished by Queen Victoria's proclamation. Allahabad, which was already a prominent administrative hub for the North-Western Provinces, was given the temporary title of Indian capital as part of this shift. This action served as a symbolic signal for the change in administrative authority and the start of direct India is ruled by the crown. The short time Allahabad lasted as capital, however, emphasised the city's significance in British India and its part in the post-rebellion governmental restructuring. Soon after, Calcutta (now Kolkata) was designated as the new capital, while Allahabad remained an important hub for administration and justice under the British Raj until India's independence in 1947.", "empire": "British Empire.", "dynasty": "" , "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 2, "city": "Kolkata", "year": "1772 until 1911", "information": "India's capital during the British Raj was Calcutta (now Kolkata), which held this position from 1772 to 1911. Calcutta was first visited by the British East India Company in 1690, but it wasn't until 1772 that the city was formally recognized as the administrative center of British India. Calcutta's strategic location along the Hooghly River made it an ideal location for the British East India Company, a significant participant in British colonial development, to promote trade and administrative control over the eastern provinces of India. The city's involvement in the military, trade, and administration of the British Raj served to further cement its significance. 1911 saw the relocation of the capital from Calcutta to Delhi as part of a larger plan to centralize administrative oversight and management of India's burgeoning nationalist movements. The political and cultural significance of Delhi, which had long been a significant hub in Indian history, was also meant to be reflected in this decision. During British administration, Calcutta remained a major commercial and cultural centre and is still an important city in India today. Its reign as the capital was characterized by substantial advancements in administration, infrastructure, and cultural institutions.", "empire": "British Empire.", "dynasty": "" ,"reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 3, "city": "Shimla", "year": "1864 - 1947", "information": "Nestled in the foothills of the Himalayas, Shimla became the summer capital of British India by the late 1800s. When Shimla was formally designated as the summer capital in 1864 by Viceroy of India John Lawrence, the shift got underway. The British considered Shimla's mild environment perfect for ruling during the summer season because they were finding it difficult to handle the scorching heat of the Indian plains. The British discovered Shimla's favorable weather and gorgeous scenery early in the 1820s, which marked the beginning of Shimla's ascent to fame. Shimla was a little settlement at first, but the British government found it more appealing after the Hindustan-Tibet Road was built in the 1850s since it made the town more accessible. With time, the village became an important center for the British, who built the Viceregal Lodge and other colonial structures, churches, and administrative buildings. Up to India's independence in 1947, Shimla functioned as the country's summer capital. The town was vital to the management of British India, particularly in the summer months when all government apparatus would relocate there from Delhi or Calcutta. One distinctive aspect of British colonial control was the seasonal migration, which they used to maintain efficiency while evading the brutal Indian heat.", "empire": "British Empire.", "dynasty": "" , "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 4, "city": "Delhi", "year": "1911 - 1931", "information": "King George V of the United Kingdom announced at the opulent Delhi Durbar on December 12, 1911, that Delhi would become the new capital of British India, replacing Calcutta. This choice was crucial because it represented a change in the British Empire's strategy for running India. Delhi was regarded as a potent symbolic option for the new capital because of its rich historical past as the capital of multiple Indian rulers. The choice was driven by multiple considerations. India's eastern city of Calcutta was viewed as being too isolated from the rest of the nation, especially from the northern areas of the country where British influence was strongest. But Delhi was more centrally located and had a rich history as the capital of several Indian empires, including the Mughals. Not long after the proclamation, work on the new capital city in Delhi got underway. The British government sought to build a large, contemporary city that would symbolize the strength and enduring nature of the British Raj in the region selected for the new capital, which was south of the former Mughal metropolis of Delhi. Two renowned British architects, Sir Edwin Lutyens and Sir Herbert Baker, designed the architectural layout. Their plans, which represented British imperial dominance, featured broad avenues, imposing structures, and expansive open areas. Known as New Delhi, the city was formally opened in early 1931 after the government, parliament, and viceroy's buildings (which are now known as Rashtrapati Bhavan) were finished. This signified the official relocation of the British central government. Delhi became the new capital of British India when Calcutta was abandoned. ", "empire": "British Empire.", "dynasty": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]}
        
    ]
}