{
    "points": [ 
        { "no": 1, "city": "Agra", "year": "1506", "information": "Sultan Sikandar Lodi established Agra as the capital of the Lodi dynasty, which ruled from 1488 to 1517. The final dynasty to rule the Delhi Sultanate was the Lodi dynasty, which originated in Afghanistan and ruled over northern India in the late 15th and early 16th centuries. When Sultan Sikandar Lodi chose to relocate his capital from Delhi to Agra in 1506, the political climate in the area underwent a dramatic change. Realizing the strategic and commercial benefits of Agra, Sultan Sikandar Lodi chose to relocate his capital from Delhi to this then-new city in 1506. Because of its strategic location beside the Yamuna River, Agra was well-suited for trade, agriculture, and military supplies. Sikandar Lodi sought to achieve his goals by making Agra the capital. in order to improve administration and solidify his hold on the empire's northern areas. Agra was a sleepy town until Sikandar Lodi made it into a thriving metropolis. The Sultan built a number of important structures, such as palaces, mosques, and forts, which helped pave the way for Agra's rise to prominence during the Mughal era. Under the Lodi kings, the city also developed into a hub of scholarship and intellectual activity, with academics, poets, and painters receiving support. During Sikandar Lodi's rule, Agra's position as the capital was further cemented, and it maintained its political significance long after the Lodi dynasty was overthrown. The city started to change into one of the most important cities in India when it was made the capital. history, eventually emerging as the focal point of the Mughal Empire under the leadership of Shah Jahan, Jahangir, and Akbar.", "empire": "", "dynasty": "Lodhi dynasty" ,"current_name": "Agra", "reference":["https://en.wikipedia.org/wiki/List_of_capitals_of_India","https://en.wikipedia.org/wiki/Agra","https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 2, "city": "Vijayanagara", "year": "14th to 16th century", "information": "One of the most powerful and affluent empires in South Indian history, the Vijayanagara Empire had its capital city at Vijayanagara, which was founded in the early 14th century. Around 1336, the Sangama dynasty's brothers Harihara I and Bukka Raya I constructed the city. Their objectives were to establish a robust defense against the Delhi Sultanate's incursions and to reinstate Hindu governance in the Deccan. In no time at all, Vijayanagara expanded into a vast metropolis that served as the epicenter of an empire spanning the Deccan and South India. The city was renowned for its magnificent temples, busy bazaars, and striking architecture, all of which reflected the wealth and might of the empire. The Vijayanagara emperors fostered a vibrant cultural environment by generously supporting literature, the arts, and religion.an atmosphere that attracted international traders, academics, and artists. Vijayanagara's vast population was sustained by the water from the Tungabhadra River, which was strategically positioned along the city's banks. But by 1585, the city had been abandoned, mostly as a result of a number of events, such as the Vijayanagara armies' crushing defeat in the Battle of Talikota in 1565 and the city's subsequent sacking. Its decline was also exacerbated by problems like the dwindling water supply and the challenges associated with maintaining the extensive metropolitan infrastructure. Long after his downfall, however, Vijayanagara's imprint persisted in shaping politics and culture in South India. The city's remains, especially in the Hampi region, serve as a reminder of the splendor and genius of the Vijayanagara Empire's architecture. The history of the city, including its rise and fall, sheds light on the difficulties involved in creating an empire in medieval India.", "empire": "Vijayanagara Empire", "dynasty": "" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 3, "city": "Patna", "year": "1538/1540 and 1556", "information": "Between 1538/1540 and 1545, Patna—formerly known as Pataliputra—became the imperial capital of Sher Shah Suri. The Suri Empire was founded in 1540 when Sher Shah, formerly known as Farid Khan, overthrew Humayun, the Mughal Emperor. He chose Patna because of its advantageous location along the Ganges River, which made it a major centre for military supply, trade, and administration. Patna was rejuvenated and enlarged during Sher Shah's reign, demonstrating his administrative prowess. Building the Grand Trunk Road, instituting a postal system, and introducing a unified currency all contributed to the expansion of his empire. Following Sher Shah's demise, the Suri Empire persisted until 1556, at which point the Mughals took back power. Patna flourished under the Mughals, when it was the capital of Bihar Subah. Bihar Subah, one of the empire’s provinces. The city’s strategic importance and economic significance made it a key center of administration and trade under both the Suri and Mughal empires. Patna’s history during these periods underscores its vital role in medieval Indian politics and governance.", "empire": "Sher Shah Suri's Empire", "dynasty": "" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 4, "city": "Allahabad", "year": "1599 to 1604", "information": "During the Mughal Empire, Allahabad—now known as Prayagraj—became a significant provincial capital. When Prince Salim, who would later become Emperor Jahangir, made it his headquarters from 1599 to 1604, it rose to great prominence. Allahabad was an important military and administrative hub due to its advantageous location at the meeting point of the Yamuna and Ganges rivers. Salim used the city as a base at this time to build his authority in preparation for taking over from his father, Emperor Akbar. The significance of Allahabad in Mughal politics and governance was highlighted by his selection of the city as his headquarters. Salim's stay in the city sparked important growth and the building of a number of important buildings, including the Allahabad Fort, which is still a well-known monument today. The Mughal Empire made Allahabad a provincial capital, which emphasizes the city's strategic and administrative importance. Under Jahangir's rule, the city's standing was further enhanced, and it kept up its vital position in the governance of the empire. Allahabad's lasting significance in the political and cultural history of northern India is demonstrated by the legacy left by the Mughals.", "empire": "Mughal Empire ", "dynasty": "" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"] },
        { "no": 5, "city": "Budaun", "year": "1211", "information": "One of the most important emperors of the Delhi Sultanate, Sultan Iltutmish, held Budaun, which is now in the Indian state of Uttar Pradesh. After rising through the ranks from being a slave to become the Sultan of Delhi in 1211, Iltutmish founded the Shamsi dynasty, which was a branch of the greater Slave dynasty. About 1211, in the early years of his rule, Iltutmish established Budaun as his capital. The city was deliberately chosen because of its strategic location in northern India, which made it possible for Iltutmish to efficiently administer the Sultanate's growing lands. As a political and military center under his leadership, Budaun provided him with the foundation from which to expand his authority over the Indian subcontinent. Iltutmish is credited with introducing the Iqta system, a system of land revenue administration, and fortifying the Sultanate's military and administrative apparatus. His rule was characterized by a time of relative peace and growth, which prepared the way for the Delhi Sultanate's eventual domination in northern India. Budaun's strategic and historical significance is underscored by its status as the capital during the Iltutmish era. Budaun continued to be an important metropolis in the area, despite the eventual relocation of the capital to Delhi, demonstrating the early stabilization of Muslim power in India. ", "empire": "Sultanate empire", "dynasty": "Shamsi dynasty, Slave dynasty." ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 6, "city": "Kanchipuram", "year": "4th to the 9th centuries", "information": "From the fourth to the ninth century, the Pallava dynasty, which gained prominence in southern India, had its capital at Kanchipuram, a city in modern-day Tamil Nadu. Around the fourth century CE, the Pallavas—who had previously been feudatories under the Satavahanas—became an autonomous force. They established Kanchipuram as their capital, turning it into a significant hub for religion, culture, and politics. Famous Pallava rulers like Narasimhavarman I (630–668 CE) and Mahendravarman I (600–630 CE) oversaw the flourishing city of Kanchipuram, which became a center of architecture and culture. The rock-cut temples and monolithic buildings of Mahabalipuram, which were built during the Pallava dynasty, are well known for their contributions to Dravidian architecture. Kanchipuram evolved become a well-known hub for education and spirituality, drawing Monks, poets, and scholars who gained the moniker City of a Thousand Temples.  The southern Indian region's cultural and religious landscape was greatly influenced by the Pallava dynasty. As the dynasty's capital, Kanchipuram was at the center of this change, symbolizing its might and sway. The city remained an important hub for Hindu scholarship and temple construction, therefore its significance persisted even after the Pallavas' decline.", "empire": "", "dynasty": "Pallava dynasty" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 7, "city": "Thanjavur", "year": "985–1014 CE", "information": "One of the most potent and long-lasting empires in South Indian history, the Chola dynasty, had its capital at Thanjavur, which is now in the state of Tamil Nadu. The Cholas gained notoriety in the ninth century, and Thanjavur became the seat of the empire under the reign of Raja Raja Chola I (985–1014 CE). Under the Cholas, Thanjavur prospered and developed into the political, cultural, and commercial center of the empire. Raja Raja Chola I started work on the Brihadeeswarar Temple at this time. It is now a UNESCO World Heritage site and a symbol of the Chola period's artistic and architectural prowess. The city was a center of Tamil culture, drawing academics, poets, and artists, and it was essential to the growth of of Tamil art and literature. With Thanjavur serving as its capital, the Chola Empire extended its sphere of influence far beyond South India, encompassing Southeast Asia, the Maldives, and Sri Lanka. Even when the Chola empire fell, the city's significance persisted for centuries, making it a permanent representation of the might and legacy of South India. The greatness of the Chola Empire and its contributions to Indian civilization are inextricably linked to Thanjavur's heritage.", "empire": "British Empire, the Vijayanagar Empire, Chola empire", "dynasty": "Mutharaiyar dynasty, the Pandyas, the Madurai Nayaks, the Thanjavur Nayaks, the Thanjavur Marathas and the Chola dynasty." ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 8, "city": "Murshidabad", "year": "1704", "information": "The first Nawab of Bengal, Nawab Murshid Quli Khan, moved the capital from Dhaka to a new city he named Murshidabad in honor of himself in 1704. This action represented the growing independence and power of the Nawabs under the crumbling Mughal Empire, and it was a pivotal point in Bengali history. Aurangzeb, the Mughal emperor, first named Murshid Quli Khan as Bengal's Diwan, or minister of finance. But with time, he solidified his position of authority and essentially took over as Bengal's de facto ruler. Situated on the eastern bank of the Bhagirathi River, Murshidabad rapidly developed into a flourishing hub of politics, commerce, and culture. It rose to become the capital of the Bengal Subah, a political entity including Orissa, Bihar, and Bengal.  The city had economic prosperity under Murshid Quli Khan's rule, with a booming trade in silk, muslin, and other items. Murshidabad's location was more advantageous for administrative control and defense, hence the migration from Dhaka to Murshidabad was also strategically significant. Under succeeding Nawabs, the city continued to serve as the capital of Bengal until the British East India Company seized power during the Battle of Plassey in 1757. Murshid Quli Khan's ascent of Murshidabad is indicative of the growing autonomy of local lords in the latter part of the Mughal era and the significance of the city as a hub of authority in eighteenth-century India.", "empire": "Mughal Empire", "dynasty": "Nasiri dynasty" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 9, "city": "Pune", "year": "1730", "information": "Under the direction of the Peshwa, the Maratha rulers' prime minister, Pune was made the capital of the Maratha Empire in 1730. The Maratha Empire, which was at its height during this time, had a pivotal milestone in its history when the capital was moved to Pune. After establishing their supremacy throughout the Deccan and beyond, the Marathas made Pune the political and administrative hub of their growing empire in an effort to maintain their hold on power. One of the strongest nations in India at the time was the Maratha Empire, which was ruled by the Bhosale family. It had successfully resisted Mughal dominance and had expanded to cover a sizable portion of the country. Pune was chosen as the capital because it was strategically situated in Maratha territory and offered a robust foundation for governing and military operations. Pune became the capital during the reign of Peshwa Baji Rao I, who was instrumental in extending the empire's sphere of influence. The city developed as a center for government, society, and military strategy. Pune also underwent substantial urban development during this time, with the building of the Shaniwar Wada, the Peshwas' seat. In summation, during the height of the Marathas' dominance in 1730, Pune became the capital of the Maratha Empire under the Bhosale dynasty, symbolizing non-Mughal authority in India.", "empire": "Maratha Empire", "dynasty": "Bhosale dynasty" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 10, "city": "Munger", "year": "4th century CE", "information": "When Mir Qasim Ali, the Nawab of Bengal from 1760 to 1764, relocated his seat of government from Murshidabad to Munger in 1763, Munger became the capital of the Nawab state. This change signaled a pivotal moment in Bengali history and highlighted the Nawab's efforts to solidify his position of authority and elude the British East India Company's pressure. Mir Qasim Ali belonged to the Bengali Nawab dynasty, which governed the province of Bengal Subah within the waning Mughal Empire. Strategic factors played a major role in the relocation to Munger, since the city provided a more defendable position and was less exposed to British military incursions. Munger, on the Ganges River's banks, was ideally situated for both military and administrative dominance. protection. Munger developed into a significant military and administrative hub under Mir Qasim's leadership. But growing tensions with the British East India Company meant that his time as Nawab was brief. After the Battle of Buxar resulted in Mir Qasim's downfall in 1764, Bengal saw a dramatic change in power towards British rule. In conclusion, Munger was the capital of Bengal under Mir Qasim Ali's Nawab from 1763 to 1764. During a turbulent time in the history of the area, it was a vital strategic point and was a part of the Nawab of Bengal dynasty.", "empire": "", "dynasty": "Nawab of Bengal dynasty" ,"current_name": "", "reference": ["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 11, "city": "Daulatabad Fort", "year": "6th century CE", "information": "The capital of the Tughlaq dynasty, which lasted from 1325 until 1351, was relocated from Delhi to Daulatabad, which is now in Maharashtra, in 1327 by Sultan Muhammad ibn Tughluq. His larger administrative and strategic changes, which included this choice, were intended to provide him more control over the enormous and varied lands that made up his empire. As a component of the larger Tughlaq Sultanate, the Tughlaq dynasty was well-known for its aspirational and occasionally divisive policies. In order to consolidate his power and counteract threats originating from the north and the Deccan, Muhammad ibn Tughluq moved the capital. Daulatabad's dry climate and limited water supplies, however, made the relocation arduous and caused great suffering for the locals. Two years later, the In 1329, the capital was relocated back to Delhi because Daulatabad was unsuitable as a long-term administrative hub. Daulatabad is an important historical landmark that reflects the high goals of the Tughlaq dynasty and the difficulties of medieval Indian governance, notwithstanding its brief reign as the capital. The history of the city highlights the difficulties emperors had in overseeing the logistics and administration of their empires.", "empire": "", "dynasty": " Tughlaq dynasty" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 12, "city": "Hanamkonda and Warangal", "year": "1199", "information": "During the 12th and 14th centuries, the Kakatiya dynasty ruled over the southern Indian subcontinent, with its capitals located at Hanamkonda and Warangal. The early 1100s saw the birth of the Kakatiya dynasty, which rose to prominence in the early 12th century. The Kakatiya dynasty's first capital, Hanamkonda, functioned as the political and administrative hub of their early period of reign. King Rudramadevi led the Kakatiyas to relocate their capital to Warangal in 1195, which was a more desirable site from a strategic standpoint. With its strong defenses and strategic location, Warangal offered superior protection and control over the vast lands of the Kakatiya Empire. The Kakatiya dynasty reached the pinnacle of its strength and influence with this act. Notable are the Kakatiyas for their contributions to architecture, which include building the Warangal Fort and a number of temples that showcase the artistic and cultural accomplishments of the dynasty. They ruled until the Delhi Sultanate overthrew the Kakatiya dynasty in the middle of the fourteenth century. The historical significance of Hanamkonda and Warangal lies in their legacy, which highlights the administrative skills and innovative architectural designs of the Kakatiyas in southern India.", "empire": "", "dynasty": "Kakatiya Dynasty" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 13, "city": "Addanki", "year": "1325 AD", "information": "In the fourteenth and fifteenth centuries, the Reddy Kingdom's capital was Addanki, which is now in the state of Andhra Pradesh. The Reddy dynasty, which controlled the Reddy Kingdom from its founding in the early 14th century, was influential in the political and cultural history of the area. Prolaya Vema Reddy, who consolidated power and cemented his dominion circa 1325 CE, formed the dynasty. Under the Reddy dynasty, Addanki emerged as the political and administrative hub of the Reddy Kingdom, and its advantageous location helped the kingdom maintain control over the lands around it. The Reddy dynasty was renowned for its military might and determination to fortify their position against neighboring nations and rising countries. In Addanki, under the Reddy dynasty, there was notable advancements in both architecture and culture, such as the building of temples, forts, and other buildings that demonstrated the kingdom's wealth and capacity for governance. The Reddy Kingdom was a significant regional force in southern India, with influence spanning across portions of modern-day Andhra Pradesh and Telangana. Due to internal strife and outside influences, the Reddy Kingdom started to weaken in the late 15th century and finally fell to the enlarging Vijayanagara Empire. Addanki's historical significance within the Reddy dynasty and its influence on regional history during its heyday are highlighted by its status as the capital.", "empire": "", "dynasty": "Reddy dynasty" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 14, "city": "Cochin", "year": "16th century", "information": "Early in the 16th century, Cochin—now known as Kochi—was for a short while the epicenter of political action. Under the Portuguese Empire's influence, the city rose to prominence in the Indian Ocean commerce network between 1505 and 1510. The Portuguese first made a substantial impact in the area in 1505, when they built a fort in Cochin. This action was a component of their larger plan to safeguard their marine routes and gain control over the lucrative spice trade. Cochin served as the Portuguese colonial administration's actual headquarters in India at this time, which made it a vital center for their trading operations. The Portuguese provided security and advantages in commerce to the Cochin Raja, the native rulers, who at first cooperated with them. But the Portuguese The Portuguese had only brief reign over Cochin, lasting until 1510 when they encountered military setbacks and opposition from rival European countries as well as indigenous groups. Changes in power occurred in the city around 1510, and the Portuguese progressively lost dominance as they turned their attention to other important places in India. In spite of this, Cochin's history was significantly shaped by the Portuguese occupation, which also highlighted the city's significance in the early European-Indian colonial exchanges.", "empire": "", "dynasty": "" ,"current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]},
        { "no": 15, "city": "Old Goa", "year": "1510", "information": "From 1510 to 1843, Old Goa, also called Velha Goa, was a prominent metropolis ruled by the Portuguese. After taking Goa from the Sultan of Bijapur in 1510, the Portuguese made Goa their colonial capital, building Old Goa. This signaled the start of Goa's more than three-century-long Portuguese era. Old Goa developed into a significant hub for trade, business, and Christianity in the Indian Ocean region while it was ruled by the Portuguese. The Portuguese built churches, convents, and administrative structures as the city flourished as a busy port and a center of culture. The most noteworthy constructions from this era are the Se Cathedral and the Basilica of Bom Jesus, which demonstrate the city's importance as a hub for both both commercial and religious endeavors. Old Goa was under Portuguese rule until 1843, when the capital was transferred to Panaji as a result of the area's deteriorating infrastructure and malaria-related health problems. Old Goa, which showcases the architectural and cultural legacies of Portuguese colonial control in India, continues to be a historical site in spite of the relocation. It represents a crucial period of Portuguese influence in India.", "empire": "", "dynasty": " Adil Shahi Dynasty" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"]},
        { "no": 16, "city": "Nova Goa", "year": "1843", "information": "After Old Goa declined, Nova Goa now known as Panaji became the capital of Portuguese India in 1843. Health problems and deteriorating infrastructure in Old Goa forced the shift, and Panaji was selected because of its better location and hygienic circumstances. Until Portuguese sovereignty ended in 1961, the city served as the political and administrative hub of Portuguese India. During the Portuguese rule, Nova Goa became the center of politics, trade, and culture in the area. During this time, the city saw tremendous growth as notable government buildings, churches, and residential neighborhoods were built. In Panaji, the Portuguese founded a thriving colonial society that gained notoriety for its unique fusion of Portuguese and Indian cultural elements. Nova Goa was crucial to the Portuguese colonial empire at this time, promoting trade and defending Portugal's strategic objectives in the Indian Ocean. But as the independence movement gained traction, so did the decolonization movements. Portuguese dominance over Goa ended when India seized the region in 1961. As a result, Nova Goa symbolized the end of Portuguese colonial rule in India and became a part of the newly independent nation while maintaining its rich imperial legacy.", "empire": "", "dynasty": "" ,"current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"] },
        { "no": 17, "city": "Pulicat", "year": "1502", "information": "The town of Pulicat, on India's southeast coast, was the seat of government for the Dutch Coromandel twice: from 1610 to 1690 and from 1781 to 1795. Early in the 17th century, the Dutch East India Company established a presence in Pulicat by taking use of the town's advantageous location for trading with the Coromandel Coast. Pulicat developed became a vital hub for the Dutch East India Company's (VOC) trading operations in southern India. The VOC was a significant colonial power. Pulicat prospered as a thriving port and a center for the spice trade during the early era of Dutch domination, making a substantial contribution to the Dutch commercial empire. The Dutch relocated their main office from Pulicat to Chennai (then known as as Madras), indicating changes in political and commerce networks. Still, Pulicat remained significant, and in the last stages of their colonial venture in India, the Dutch restored their administrative presence there from 1781 until 1795. As part of the Treaty of The Hague, the Dutch gave the British East India Company control over its Indian colonies, including Pulicat, in 1795. Following Pulicat's transfer to British sovereignty and subsequent transformation into a more sedate port city while keeping its historical value, this signaled the end of Dutch colonial rule in the region.", "empire": "", "dynasty": "","current_name": "", "reference":["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ] },
        { "no": 18, "city": "Nagapatnam", "year": "1799 to 1845", "information": "During British administration, Nagapattinam, on the southeast coast of India, was an important administrative center from 1799 to 1845. During this time, it served as the Tanjore district's capital under the Madras Presidency. With the defeat of Tipu Sultan in the Fourth Anglo-Mysore War, British rule over the region commenced in 1799. As the British East India Company expanded its influence throughout southern India, Nagapattinam was chosen to serve as the district capital of Tanjore because of its strategic port location and historical importance. Under British rule, Nagapattinam grew to become a major center for trade and administration during this time. The city's significance in local governance and trade was emphasized during British rule. The British made use of the port at Nagapattinam to trade and effectively administer the neighboring areas. The city had administrative and infrastructural modifications in line with British colonial principles. A larger administrative reform in the British Madras Presidency took place in 1845 when administrative functions changed and the capital of the Tanjore district was relocated from Nagapattinam to Tanjore (Thanjavur). Nagapattinam remained a significant regional port and cultural hub in spite of this development.", "empire": "", "dynasty": "","current_name": "", "reference":[ "https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives"] },
        { "no": 19, "city": "Pondicherry", "year": "1674", "information": "Puducherry, formerly known as Pondicherry, served as a major French colonial hub in India. When the French East India Company founded a trade post there in 1674, it signaled the beginning of French involvement in the area and gained significance. In an attempt to establish a solid presence in southern India, the French crowned Pondicherry as the capital of French India, a subcontinent that was a part of the larger French colonial empire. Pondicherry served as the political and administrative center of French India from 1884 to 1954. With its unique French architecture, grid-like street design, and lively cultural influences that mirrored its colonial heritage, the city was painstakingly designed and developed. Pondicherry is a prominent example of French colonial governance because to the administrative, economic, and social policies that the French adopted. urban planning and management. Pondicherry's advantageous location along India's eastern coast made it a crucial port and hub for French trade. Up until 1954, when a vote led to its official integration with India, it remained the center of French rule. Presently, Puducherry preserves its French heritage and serves as a singular reminder of India's colonial past.", "empire": "", "dynasty": "" ,"current_name": "", "reference": ["https://www.furkatingcollege.edu.in/wp-content/uploads/2021/05/History-of-Early-India-From-the-Origins-to-AD-1300_Thapar.pdf" , "https://www.rarebooksocietyofindia.org/book_archive/196174216674_10154892000456675.pdf" , "Encyclopaedia Britannica or the Government of India Archives" ]}
    ]
}